{
	"article": [{
		"title_short": "Netlfix's Castlevania",
		"title_long": "Netlfix's Castlevania",
		"author": "Nick",
		"read_time": "1:26 min view",
		"pub_date": "05/25/2017",
		"theme": "ccard_tall",
		"summary_quote": "Who killed Dracula?",
		"tags": [
"TECH",
"COMICS",
"DESIGN",
"GAMES",
"GEAR",
"MOVIES",
"SOCIAL",
"WRESTLING"
		],
		"body_1": "The Castlevania franchise has been on my mind a lot lately. I absolutely adore the series of games, but it’s been a long time since I’ve played a good one of them. Games these days are borrowing and taking inspiration from the Castlevania formula and implementing them, resulting in some of my favorite games as of late, such as the roguelike Dead Cells and the Dark Souls/Castlevania inspired Salt and Sanctuary. Not to mention Castlevania’s spiritual successor, Bloodstained, which I’m very much looking forward to.",
		"img_1": {
			"alt": "",
			"src": ""
		},
		"body_2": "The trailer for the animated Netflix series, seemingly based around Castlevania 3: Dracula’s Curse, looks promising and does indeed pique my interest in a franchise I thought to be, if not dead, at least stalled for the time being. I mean, it is Konami we’re talking about here. Since the surprise announcement of this series last year the news has been quiet. It’s been so quiet that I admit I totally forgot they were even making this. Could this show draw some attention to the game series and perhaps lead to another well-made game? Never say never, however, I’m not holding my breath over here.  ",
		"img_2": {
			"alt": "",
			"src": ""
		},
		"body_3": "There’s a ton to work with in terms in pre-established art style, music, and characters but, very little in the way of story and plot. From the teaser trailer, it’s has striking visuals going for it at the very least. We will have to wait until July 7th to see if Red and Transmetropolitan comic writer Warren Ellis and company can get people psyched about what is generally considered one of the best video game franchises ever. A franchise that will always be in my heart, so I’m hoping for the best.",
		"img_3": {
			"alt": "",
			"src": ""
		},
		"body_4": "",
		"img_4": {
			"alt": "",
			"src": ""
		},
		"body_5": "",
		"img_5": {
			"alt": "",
			"src": ""
		},
		"soundcloud": "",
		"youtube": "iIMrFnl5NiA",
		"show_portfolio": true,
		"show_blog": true
	}]
}
