{
	"article": [{
			"title_short": "Wrestle Kingdom 12",
		"title_long": "Wrestle Kingdom 12",
		"author": "Nick",
		"read_time": "15 min read",
		"pub_date": "1/4/2017",
		"theme": "",
		"summary_quote": "A dobule main event! Does that mean no main event?",
		"caption": "Wrestle Kingdom 12",
		"caption_class": "ccard-caption",
		"tags": [
"WRESTLING",
"LOL",
"TECH",
"COMICS",
"DESIGN",
"GAMES",
"GEAR",
"MOVIES",
"SOCIAL",
"WRESTLING"
		],
		"body_1": "Whew boy! Mere hours after one of my favorite yearly shows, the all-too-familiar sinking feeling of knowing that it's all over has settled deep in my stomach. There still resides a tinge of excitment inside of me, so I shall harnish this residual rush of Japenese-fueled adreneline to attempt and discuss what I witnessed over the last six hours and change.---",
		"img_1": {
			"alt": "",
			"src": "/content/wrd-18-1.jpg"
		},
		"body_2": "-B-The Good-E- ---The Young Bucks vs Roppongi 3K---This was the best bucks match at the Tokyo Dome in recent memory. Not to say their other outings were bad, I just really enjoyed the storytelling this time out. Both teams deal with injuries, as Sho and Matt sell their backs. Matt in partcuilar did a wicked job after spilling to the outside and dealing with what looked like legitmate back pain. If it wasn't, he sold it quite well. If it was, he's a total warrior. Matt teased being too injuired to tag in at various points in the match. Sho takes the lion's share of the beating and the brothers Buck cut off one side of ring leaving Sho unable to tag out. Sho attempts a comeback with Yho taken out, however, his back gives out completely and he falls prey to Meltzer Driver and a Sharpshooter for the submission.---The bucks occasionally get shit in regard to some strange sentiment that their matches are psychology-derived spotfests. This isnt always true, and I think it's important to consider the context of the show they are performing in. Take, for instance, when I saw them perfrom for ROH last October in Chicago. Matt and Nick played up their usual spots, Elite chanting, and general grandstanding. As was made evident by the noisy ROH crowd, this was exactly what people came to see. In Japan, however, and more so in the big show of the year, they wrestled a much more logical and measured style of match. I take the introudction of the sharpshooter to the duo's arsenal last year as a pivoting point in their act. The brothers seemed to take some of the spotfest critcism to heart and made some concessions with how they wrestle in certain environments. This match in particular showed how any current adoption of that critcism is just plain invlaid nowadays. The Bucks are awesome. Pass it on.---Sho and Yho get over quicker and quicker as of late, which is a good sign considering they've felt a bit stagment the last few months. I look forward to many more matches between these teams.",
		"img_2": {
			"alt": "",
			"src": "/content/wrd-18-2.jpg"
		},
		"body_3": "Hirooki Goto vs Minoru Suzuki---I was a bit taken aback by this one.",
		"img_3": {
			"alt": "",
			"src": "/content/wrd-18-3.jpg"
		},
		"body_4": "Wrap up",
		"img_4": {
			"alt": "",
			"src": ""
		},
		"body_5": "",
		"img_5": {
			"alt": "",
			"src": ""
		},
		"soundcloud": "",
		"youtube": "",
		"show_portfolio": false,
		"show_blog": true
	}]
}
