{
	"article": [{
		"title_short": "A Look at Jodorowsky’s Dune",
		"title_long": "A Look at Jodorowsky’s Dune",
		"author": "Nick",
		"read_time": "15 min read",
		"pub_date": "12/04/2014",
		"theme": "",
		"summary_quote": "A movie that would have altered the Science Fiction genre as we know it",
		"tags": [
			"MOVIES",
			"GAMES",
			"WRESTLING",
			"COMICS",
			"GEAR"
		],
"body_1": "Jodorowsky’s Dune is a 2013 documentary that highlights the conception and ultimate failure behind the original cinematic adaptation of Frank Herbert’s universally acclaimed book, Dune. Coined “the greatest science fiction movie never made,” Alejandro Jodorowsky’s surreal and visionary project inspired some of Pop-Culture’s and Science-Fiction’s biggest names to jump on board. Jodorowsky’s Dune is a journey of dedication, heartbreak, outrageous coincidences and chance encounters that nearly lead to a movie that would have altered the Science Fiction genre as we know it. This documentary depicts the unrealized potential that Jodorowsky’s would-be-film possessed, and the movies the unfinished project influenced for decades to come.---Alejandro Jodorowsky is a Chilean director who rose to prominence with El Topo, a surreal and outright disturbing western/love story hybrid. El Topo caught the attention of eclectic moviegoers and is considered to be the very first midnight movie, a cult-status film shown at theaters at midnight. It even attracted the likes of John Lennon and Yoko Ono, both of whom helped fund Jodorowsky’s next movie, The Holy Mountain. This film would also go on to become a hit, largely in Europe and, after meeting French producer Michel Seydoux, Jodorowsky was offered the choice of making whatever movie he wanted. He chose Dune.",
		"img_1": {
			"alt": "Dune",
			"src": "/content/wrd-3-1.jpg"
		},
"body_2": "For two years, Jodorowsky prepared for what he called the coming of an “artistical, cinematographical God” and the movie that would “change the young minds of all the world.” Through a string of unlikely encounters and humorous stories, Jodorowsky assembled a team of what he called his “spiritual warriors.” The documentary sheds light on how he persuaded the likes of Mick Jagger, Orson Welles, Salvador Dali, David Carradine, and Pink Floyd to take part in his project. He also enlisted Science Fiction powerhouses Dan O’Bannon, Jean “Moebius” Giraud, and surrealist painter H.R. Giger, all of whom later went on to work on Ridley Scott’s Alien, among other things.---After two years of pre-production work, Jodorowsky visited numerous movie studios with every single detail of Dune plotted out in one massive book. This book contained a storyboard with 3000 drawings that detailed point of view, movement of camera, and dialogue. It also included concept designs by Moebius and colored illustrations by H.R. Giger. Most movie studios were impressed with what they saw; none, however, wanted to offer the remaining funding Jodorowsky needed. They lacked faith in his vision and they feared that Dune would run too long, it would over go over budget, and wouldn’t find an audience. Some people argue that the movie studios were wrong, as Star Wars made its cinematic debut only two years later. Others dispute this, however, claiming Star Wars’ story was tame compared to what Jodorowsky had in mind for Dune.",
		"img_2": {
			"alt": "Book",
			"src": "/content/wrd-3-2.jpg"
		},
"body_3": "The documentary also discusses all the derivative influences that were potentially a result of Jodorowsky’s work. It attempts to prove that many iconic Science Fiction movies where tangentially influenced and inspired by his ill-fated project. The myth is that Jodorowsky’s massive book remained at studios for years following his rejection, and was often referenced to and used as a guide by many of Science-Fiction’s greatest names. Scenes from Dune’s storyboard are seen in famous movies like Star Wars, The Terminator, Flash Gordon, Raiders of the Lost Ark, Masters of the Universe, and Contact. Despite being eerily similar, it’s not definitive whether or not Dune’s storyboard influenced some of these movies; there is no denying, however, that Jodorowsky was clearly ahead of his time.---Dune’s film adaptation was eventually handed off to another surrealist director, David Lynch. This didn’t go so well. Lynch felt that the people who helped him make the movie were working against him. When the movie was released, over an hour of footage was cut, causing the film to confuse the majority of people who saw it. Lynch distanced himself from his version of Dune and laid the blame of its commercial and critical failure on the producers and studios behind the film. He even went so far as to have his name stricken from the extended cut.---It’s interesting to think about how Jodorowsky would’ve handled that situation had his version been made. Movie studios feared his adaptation of Dune would’ve been too long, and Jodorowsky states in the documentary that his version would’ve been any length it needed to be. He also wanted $15 million for his film when, two years later, Star Wars was made for only $11 million. It’s hard to say what exactly caused Hollywood to collectively pass on Jodorowsky’s adaptation. Had his Dune come out before Star Wars, the landscape of Science Fiction in film might be entirely different.",
		"img_3": {
			"alt": "",
			"src": "/content/wrd-3-3.jpg"
		},
"body_4": "The iconic position that Star Wars enjoys in the minds and hearts of fans could be instead be occupied by the epic struggle for spice, water and, of course the giant worms. If Dune was released before Star Wars, viewers would have been introduced to a much more complex universe in which, for example, psychedelic drugs are used to bend time and space—making the Jedi look tame in comparison. It’s possible that reality bending, surrealist Science Fiction may have become mainstream quicker if audiences were predisposed to advanced concepts like the pre-born in Dune.---Still, I can’t shake the feeling that Star Wars eased the masses into the world of Science Fiction on the big screen. Dune worked as a book, as that was the only way Science Fiction could thrive back then. It’s possible that a movie adaptation would have alienated the audience from the genre altogether. Regardless, Jodorowsky assembled the team that would work behind Alien, and it’s hard to say if they would’ve met otherwise. Before the release of Star Wars, Science Fiction wasn’t represented well in film, save for a few rare exceptions. If his Dune succeeded, Jodorowsky could’ve been the George Lucas of Science Fiction. If it failed, Star Wars could’ve very easily been passed on for fear of making the same mistake. If anything, Jodorowsky’s Dune forces you to ask one massive question about a beloved genre of film: what if?",
		"img_4": {
			"alt": "",
			"src": "/content/wrd-3-4.jpg"
		},
		"soundcloud": "",
		"youtube": ""
	}]
}
