{
	"article": [{
			"title_short": "Best of the Super Juniors 25 May 18th",
		"title_long": "Best of the Super Juniors 25 May 18th",
		"author": "Nick",
		"read_time": "20 min read",
		"pub_date": "5/18/2018",
		"theme": "",
		"summary_quote": "Taiji Ishimori makes re-debut versus Will Ospreay. Other Block A matches.",
		"caption": "May 18th - Block A",
		"caption_class": "ccard-caption",
		"tags": [
"WRESTLING",
"LOL",
"TECH",
"COMICS",
"DESIGN",
"GAMES",
"GEAR",
"MOVIES",
"SOCIAL",
"WRESTLING"
		],
		"body_1": "Best of the Super Juniors 25 kicked off with Block A matches on 5/18 in Korakuen Hall. Sho, Chris Sabin, and Flip Gordon made their tournament debuts. Taiji Ishimori made his New Japan debut as Bonesolider in the main event against IWGP Junior Heavyweight champion Will Ospreay.---Best of the Super Juniors 24 saw Kushida defeat Will Ospreay in the finals and the tournament itself was the last for Jushin Thunder Liger, who hardly won any of his matches.---",
		"img_1": {
			"alt": "Best of Super Jr",
			"src": "content/wrd-2-1.jpg"
		},
		"body_2": "This year’s tournament has promising talent and some potential for a breakout performance or two (I’m looking at you Yoh and Sho).---Quick note: Best of the Super Jrs is a long but quick-paced tournament for both the wrestlers and viewers. With such being the case, these articles will undoubtedly be shorter than I would normally write for a larger New Japan show. ---Block A consists of: Will Ospreay, Taiji Ishimori, Flip Gordon, Yoh, Tiger Mask, Bushi, ACH, and Kanemaru.---Block B consists of: Ryusuke Taguchi, Chris Sabin, Sho, El Desperado, Marty Scurll, Dragon Lee, Kushida, and Hiromu Takahashi.---Will Ospreay has defended his belt against Hiromu, Marty, and Kushida at various points in the last few months. Taiji Ishimori is my front-runner for Block A, as well as the entire tournament. His debut at Wrestling Dontaku was impactful, with Ishimori directly attacking Ospreay. For me it’s not a matter of if he wins but how he gets there. As for Hiromu, Marty, and Kushida, I would think they will have strong showings. My guess for the Block B winner is either Marty of Hiromu, although I wouldn’t be surprised if that’s not the case.  I’m very much looking forward to seeing how well Sho and Yoh do and I’m hopeful they go further than expected. This is their time. Flip isn’t a complete wrestler quite yet, although it’s impressive the mere fact that he’s in this tournament only two years into his career. As is usually the case in BOSJ, one of the lower-rung guys will probably have a good run and throw off some predictions.---Let’s talk about night one.--- -B-Prelims-E- ---Chris Sabin and Ren Narita over Kushida and Shota Umino. The match mainly consists of Kushida putting the work on the young lions. As can be seen in the last Young Lion’s Project, both Umino and Narita are pretty damn talented at this point. On a semi-related note, I plan to write about Kawato’s progress in CMLL, which is to say….been interesting to watch. Sabin gets the pin on Shota.---Next up it’s Yoshi-Hashi and Sho over Dragon Lee and Oka Tomoyuki. Now dubbed “High Voltage”, Sho waves off Yoshi-Hashi and starts the match against Dragon Lee. Sho left an impression on me almost immediately. He looks both cocksure and vulnerable, keeping his head down while maintaining a very stern demeanor. A stark difference from the flashy, flamboyant presentation that he and Yoh put forth with Roppongi 3K. This reflects down to his gear tonight as he trades the foil silver tracksuit and jewelry for black and yellow trunks. Even though it’s not a tournament match yet, this is his first showing during the tournament. It’s his time to shine and he has to prove to everyone, including the fans and those backstage, that he is ready.---During the opening segment it takes approximately two minutes for Sho to prove to everyone that he is indeed ready. Admittaley Dragon Lee is a hell of a dance partner. The two exchange holds and pins in a frantic opening two minutes. Also worth noting, it’s clear how well-built Sho is when standing next Dragon Lee, who has won multiple bodybuilding competitions in Mexico. There’s no fucking way Sho remains a junior heavyweight in the future. As for the rest of the match, Oka and Hashi trade for a while and Hashi submits him with a -I-Butterfly Lock-E-.---Minoru Suzuki and El Desperado over Ryusuke Taguchi and Toa Henare. Not much happening here. Suzuki and Desperado implement the typically Suzuki-gun offense and it’s not long into the match before they toss Taguchi into the crowd and use to chairs to run wid on the young lions on ring side. Taguchi and Henare make a short comeback before Henare falls victim to a -I-Gotch Piledriver-E- from Suzuki.---EVIL and Hiromu Takahashi over Marty Scurll and Chase Owens. Marty finds a fan’s Daryl Jr, slams the stuffed cat on the ground, and does the Stone Cold double middle fingers bit. Sure, why not.---",
		"img_2": {
			"alt": "",
			"src": "content/wrd-2-2.jpg"
		},
		"body_3": "Takahashi and Scurll open the match up, and with their opening exchanges, remind the crowd that they can steal the show if they wanted. That, however, is not the point of this match, so soon EVIL is tagged in. Eventually, Owens and Takahashi are tagged in. We soon get our second submission of the night when EVIL taps out Chase Owens with a -I-Banshee Muzzle-E-. We haven’t seen this hold since last G1 when EVIL applied it to Okada, and graced the cover of Wrestling Weekly. EVIL would later win that match and be the first man to pin Okada in over a year.---",
		"img_3": {
			"alt": "",
			"src": "content/wrd-2-3.jpg"
		},
		"body_4": "-B-A Block Matches-E- ---Tiger Mask vs Yoshinobu Kanemaru---Better than I expected but still not great. It was quick, which I think serviced it well. Kanemaru used every dirty trick in the book: knocking the ref down for a low blow, the early ambush at the bell, throwing young lions at Tiger Mask, and so forth. Tiger Mask was able to feed off the energy of the crowd, of which there was some (probably because it was the first tournament match), and rolled up Kanemaru for a surprise win.---Tiger Mask [1-0] Yoshinobu Kanemaru [0-1]---ACH vs Flip Gordon---ACH comes out donning the AAW Championship belt. AAW is a promotion that runs in the Chicago area and they run shows that have featured the likes of Penta, Fenix, Naito, Jushin Thunder Liger, and more. I’m ashamed to say I’ve yet to attend a show despite the fact that they run so close to me. I’ll rectify that one day.---They go for a few crazy spots here. Flip starts with a double springboard front flip. A few minutes later, Flip then hits ACH with a crossbody from the Korakuen Hall stairs entrance. ACH just makes a 20 count back into the ring and beautifly sells his arm. This highlighted the difference between the two wrestlers. Flip’s idea of selling is acting tired on floor, whereas ACH makes it clear his arm is in pain. He wills through the pain, gets the crowd behind him, and pins Flip with a -I-Spirit Bomb-E-.---ACH  [1-0] Flip Gordon [0-1]---Yoh vs Bushi---Yoh totally looks like Stardust Genius Naito. Is that what he was going for? The colors. The tassles. The pads. It’s weird.---",
		"img_4": {
			"alt": "",
			"src": "content/wrd-2-4.jpg"
		},
		"body_5": "Bushi attacks Yoh before the bell. This, along with the wrestlers just beating a 20 count, is done way too often in New Japan. Except for the last match, this happened in every other match tonight. Bushi takes control in the early going. It’s worth noting that the crowd is nowhere near as hot as they were for Sho and Dragon Lee. After only a few minutes, Yoh counters what looks to be a Codebreaker with a pin for the quick victory. This one is a bit of an upset. The match itself seem to fall flat.---Yoh [1-0] Bushi [0-1]---Will Ospreay vs Taiji Ishimori---The main event of the night is next. This Taiji Ishimori’s first match back with New Japan as well as first since being a young lion many years ago. Ospreay comes out swinging with two dropkicks and a barrage of punches, as if to say “fuck you” in response to Taiji’s actions at Wrestling Dontaku.---Ishimori irish whips Ospreay into the crowd, however, Will jumps over the first few rows of seats, lands on the upper platform and immediately front flips onto the Bone Soldier. Will Ospreay does this because he’s Will Ospreay and that’s that. With the exception of the brief Dragon Lee, Kushida, and Takahashi stuff we saw earlier, these are far and away the best wrestlers on the show. It’s a given that with Ishimori’s debut, the fact that this is the main event, and Ospreay’s penchant for giving it his all every single match, that this would be the match of the night. That said, it’s stark and noticable the difference in quality of these two wrestlers and most others on the show tonight. They are both so damn crisp and quick. They have the crowd eating from their hands from the get-go.---Ospreay counters a handspring elbow….with a handspring kick. It looked fantastic. It’s not just stuff like this that sets the duo apart. It’s also the use of timing in which they do it. Timing is so important for wrestling and Will is the damn master at it. Yes, he can do pretty much every special move in the book but he knows exactly when to do them and when to sell. It’s something that places him the upper echelon of active wrestlers today. For instance, right after countering the handspring elbow, Will goes for a 619 but pauses for a second and winches in pain when his upper back hits the rope.---Ishimori weathers the storm and picks his moment perfectly, when he counters an -I-Ozcutter-E- with a -I-Bloody Cross-E- for the pin. The Bone Soldier has now pinned the champion in his re-debut with the company. He’s gotta be a favorite to win the whole thing, right?--- -B-Wrap up-E- --- It was a decent first night. The show never kicked into -I-that-E- New Japan gear. Highlights for me included the Yoh and Dragon Lee interactions as well as the main event. Block B starts tomorrow, see you then!---",
		"img_5": {
			"alt": "",
			"src": ""
		},
		"soundcloud": "",
		"youtube": "",
		"show_portfolio": false,
		"show_blog": true
	}]
}
