{
	"article": [{
			"title_short": "NJPW Wrestling Dontaku 2018",
		"title_long": "NJPW Wrestling Dontaku 2018",
		"author": "Nick",
		"read_time": "20 min read",
		"pub_date": "5/5/2018",
		"theme": "",
		"summary_quote": "The Alpha returns, The Rainmaker makes history, and an unstable Bullet Club celebrates an anniversary.",
		"caption": "Wrestling Dontaku Night Two",
		"caption_class": "ccard-caption",
		"tags": [
"WRESTLING",
"LOL",
"TECH",
"COMICS",
"DESIGN",
"GAMES",
"GEAR",
"MOVIES",
"SOCIAL",
"WRESTLING"
		],
		"body_1": "New Japan Pro Wrestling -I-Wrestling Dontaku 2018 -E- Night Two ran on the evening of 5/4 at the Fukuoka Kokusai Center in Fukuoka, Japan.---Will Ospreay defended the IWGP Junior Heavyweight Championship against Kushida. Kazuchika Okada successfully made company history in defending the IWGP Heavyweight Championship for the 12th consecutive time against former company ace and longtime rival, Hiroshi Tanahashi. This show came at the right time for New Japan, who were having a lackluster year following the amazing January 4th Tokyo Dome show. It wasn’t that the wrestling wasn’t particularly good as of late, and it’s not that they haven’t put on a decent show in a while (The Long Beach show in California was -I-excellent-E-). It’s just that the promotion had a lot of eyes on them following the hot angles at Wrestle Kingdom 12 and it’s questionable if they properly followed up to warrant continued viewing. Hell, I consider myself a hardcore fan, and in terms of exposition and story-based momentum, there was very little reason for me to watch the last few months, outside of just seeing some above average wrestling. There’s so many stories to tell following the Tokyo Dome and for better or worse they decided to wait until tonight to kick them off.---Let’s dig into it.---",
		"img_1": {
			"alt": "NJPW Wrestling Dontaku 2018",
			"src": "content/wrd-21-2.jpg"
		},
		"body_2": "-B-Prelims-E- ---Nothing much to the prelims. Ryusuke Taguchi, Tiger Mask, and Jushin Thunder Liger over Ren Narita, Shota Umino, and Tomoyuki Oka. Chase Owens and Yujiro Takahashi over Tetsuhiro Yagi and Yuji Nagata. Sho, Yho, and Rocky Romero over Iizuka, Tachi, and Taka Michinoku. Toru Yano and Tomohiro Ishii over Toa Henare and Togi Makabe. Jay White, Yoshi-Hashi, and Hirooki Goto over Michael Elgin, David Finley and Juice Robinson. Yoshi-Hashi pinned Finley with a laritat followed up by -I-Karma-E-, his pumphandle driver finisher. Finley recently had a good match with Jay White for US title, and Juice was following up a stellar match with Goto for the NEVER title, both back in late April. The Juice/Goto match stole the show on a card headlined by Okada and Ospreay versus Kushida and Tanahashi.---Following the match tonight, Tachi attacks Goto and Jay White attempts to attack Juice Robinson, presumably setting up the next the next program for those two belts.--- -B-The Alpha Returns-E- --- Following a match that saw Los Ingobernables De Japon defeat Suzuki-gun, Naito was in one for one hell of a surprise. Sort of. There were reports of Jericho sightings at the Fukuoka airport a day prior. Perhaps Naito should have done his reading online to avoid such an altercation: One would think he would do so after the surprise attack at New Year’s dash earlier this year. Regardless, Naito was grabbed and subsequently punched by a fan donning Los Ingobernables-style lucha mask. This fan then proceeded to jump the barricade, grab Naito by the hair and drag him back to the ring, but not before slamming him with a guard rail and throwing him over another one. Apparently there was a little girl crying in the front row. The fan unmasked and, to much delight of the crowd, revealed himself to be Chris Jericho.---Jericho was wearing a new (and, yes, already for sale) Los Ingobernables-style t-shirt that read, “Lista Ingobernables de Jericho”. Clever. Of course I want one. Jericho beat on Naito, hit him over the head with a ring bell drawing blood, and hit him some more for safe measure. Naito was bleeding badly, a rare sight in New Japan. That type of rarity is part of the Jericho “Alpha” gimmick, playing a loose cannon whose willing to prove he’s the toughest in the company by any means necessary. This includes sucker punching, surprise attacking, and beating the ever-loving shit out of the top babyfaces. Jericho, both in his appearance here and the appearances versus Omega, takes small moments to relish in the crowd reaction, but quickly overcomes them and proceeds to overcompensate with over-the-top beatings and expletives bleached at the crowd in attendance. New Japan Chris Jericho is much different from WWE Chris Jericho, who was seen just last week as the 50th entrant in the WWE Greatest Royal Rumble: The comicialy delusional, LED scarf wearing Jericho is not remotely the same as the perhaps dangerously delusional scarf wearing leather pants clad “rockstar” Jericho seen last night. Also, I’m a big fan of the eyeliner and black lipstick. I know it was worn to accentuate the mask, however, I think he should keep it. Perhaps even as way to taunt Naito.---",
		"img_2": {
			"alt": "",
			"src": "content/wrd-21-3.jpg"
		},
		"body_3": "Jericho is eventually escorted out and Naito gets to his feet and leaves. Keeping his stoic, emotionally-detached demeanour somewhat intact was quite the site considering he was drenched in blood.--- -B-An Unstable Bullet Club Manages to Celebrate an Important Anniversary-E- ---The Bucks and Marty are coming off winning the NEVER Openweight 6-Man Tag Team Championship from Bad Luck Fale, Tama Tonga, and Tanga Loa on night one. Tonight, like many other nights, features a Bullet Club vs Bullet Club match: Bad Luck Fale, Tama Tonga, Tanga Loa, and the Golden☆Lovers versus Cody, Hangman Page, Marty Scurll, and The Young Bucks. Kenny throws his shirt into the crowd. Cody chases it down back into the further rows and rips the shirt from the hands of the fan. It was awesome and a clever, yet simple way of getting some heat. This is something Cody excels at. Kenny is sporting full blonde hair, either playing on the “Golden” aspect of the Golden☆Lovers, or perhaps mirroring Cody’s bleached blonde hair. Marty and Fale open up the match and Marty insists on body slamming Fale. He isn’t successful. Marty always finds a way to elevate these multiman tags with humorous side stories, like his impossible quest to bodyslam a damn near 350 pound man. I would hope he does it at one point, to whatever degree he is actually physically able to. What a pop that would get.---The match overall was a bit messy, however, Nick and Tama Tonga have a nice exchange and the Golden☆Lovers run wild for a bit, teasing a -I-Cross Slash-E- to no avail. The match is over when Marty attempts to bodyslam Fale yet again but Fale’s weight causes Marty to collapse and the Underboss gets a 3 count without any offense. A neat way to the end the match. The focus here wasn’t the match though, it was what came after.--- ",
		"img_3": {
			"alt": "",
			"src": "content/wrd-21-4.jpg"
		},
		"body_4": "The lesson learned tonight is that (most) of the Bullet Club is fine. Both Cody and Kenny (w/ Ibushi) storm out after the match. Chase Owens and Yujiro Takahashi emerge from the back to greet the rest of the Bullet Club in the ring. The group throws up a Too Sweet, to which Nick, Matt, and Marty throw up as well. Interesting considering the legitimate cease and desist letter sent to them by WWE. This would be the first time they threw up the hand sign this year, and for much of last year too. It could be either that they figured they would test their luck with one symbolic gesture on the (approximate) 5 year anniversary of the groups formation, or that they might fight against the cease and desist entirely, continuing the use the gesture. I would guess the former, as they stated recently on Chris Jericho’s podcast that they were considering moving on from the Too Sweet before they ever got the letter. They also mentioned that they were reached by numerous lawyers offering to take the case pro bono, and this was months and months ago, so I would assume they decided not to fight it a long time ago. Nonetheless, it was a neat gesture to throw it up tonight. It helped proved that, yes, most of the Bullet Club is fine. This was symbol of unity between every member of the club, sans Kenny and Cody.---As Kevin Kelly sarcastically notes, “18,000% inflation, everything’s fine. Riots in the street, everything’s fine. They’re storming the castle, everything’s fine.” I guess he believes that the group cannot move on as a until the dispute between Cody and Kenny is settled. Last thing we see is Marty yelling to seemingly no one, “I’m gonna body slam Fale like he’s Andre the Giant”, and you know what? I believe in him. Again, what a pop that would get.--- -B-Junior Heavyweight Championship Match-E- ---Ospreay's reign is on track to be one of the more memorable Junior Heavyweight campaigns in a long time. After gaining the title at October’s King of Pro Wrestling over Kushida, Ospreay lost it on his very first defense to Marty Scurll at Power Struggle. He then won the belt for a second time in the 4 way match at Wrestle Kingdom 12 and successfully defended in a rematch against Scurll. Every match is must see and every Junior Heavyweight Championship has an air of importance surrounding as of late. As for tonight’s match, Will Ospreay and Kushida are on another level. That’s really all I can manage to say. Osprey's rematch with Marty was one of the better matches of the year, but I feel like this is one is even better. The pair were extra crisp and they threw everything they had at the wall for this match. Added bonus: there was no freak spot gone wrong like in the Scurll match with the ring apron Spanish Fly that busted Ospreay’s head up real good. Seriously, just go watch this match. Writing out the spots won’t do it any real justice.---Ospreay pins Kushida with -I-The Storm Breaker-E-, a double underhook gutwrench into a corkscrew neckbreaker. It was gnarly.---Will celebrates as the lights go out.---A video package for Bullet Club’s Bone Soldier plays. Tama Tonga emerges from the back. He strides to the ring and is then handed a microphone. He cuts a short promo, drawing Ospreay’s gaze, as a figure donning a vest and skull mask approaches him from behind. Tama Tonga removes the mask from the new Bone Soldier and reveals him to be none other than Taiji Ishimori, the 35 year old junior heavyweight of Pro Wrestling NOAH fame.---Taiji Ishimori was formerly at Young Lion training in New Japan’s dojo system. He left after only two years for All Japan Pro Wrestling and Pro Wrestling NOAH. It was in NOAH that Ishimori found a home, becoming a staple of the Junior Heavyweight division. He won the GHC Junior Heavyweight Championship 3 times, and the Junior Heavyweight Tag Team Championship 6 times. Taiji spent most of his career as a freelancer, doing AAA in Mexico as well Impact Wrestling (as a former Impact X Division Champion), both while representing NOAH. His defection to New Japan is a blow to NOAH fans. He was beloved in the promotion. I can’t necessarily blame Ishimori for leaving for New Japan at the age of 35, especially for such a prominent spot. Nonetheless, I can’t help but feel for the NOAH faithful. This is undoubtedly a big loss.---Ishimori will be the second person to play the Bone Soldier character. Mitsuhide Hirasawa originally wore the Bone Soldier mask, but was considered to be the worst wrestler in the promotion. On numerous occasions his portrayal was referred to as a failure. Hirasawa was eventually let go with gambling issues cited as the reason. There is zero doubt Ishimori will be a massive step up, both as the Bone Soldier character and as a member of the Bullet Club.---Ishimori poses a bit and mean mugs a bit for the cameras then walks to the back. Both a debut and a throwing down of the gauntlet to Ospreay, one would think this match would take place at -I-Dominion-E- in June.--- -B-IWGP Heavyweight Championship Match-E- ---It’s main event time. Tanahashi has long held the IWGP record of 11 title defences, a record that is tied by Okada at this point. As Kevin Kelly notes, their record stands at 4-4-2. Tonight will be a tiebreaker in that regard either way. These two share one of the best rivalries in pro wrestling history, if not the absolute best: Any time I get to watch them wrestle is an honor. There is no other suitable opponent than the once-in-a-century talent for the Rainmaker to attempt and break the defence record. Let’s take a deep dive into the match itself.---Tanahashi dominates the opening exchanges. Okada takes control and mocks Tanahashi by standing over him and posing. This is met with loud booing. With a history of getting too cocky with Tana and it costing him, Okada seems to be having a little bit too much fun. Tana takes advantage of the cocky Rainmaker and lights him up with strikes. This is a story they have told many times throughout their matches. Okada regains composure and works on Tana’s neck. Okada has full momentum going before getting cocky yet again flashing a smarmy smile, and Tana manages to reverse a neckhold into a neckbreaker. It seems Okada lost focus. When will he learn? Okada shows little signs of being cocky versus other challengers but it’s apparent that Tana brings this out of him. If Kenny is able to break down Okada physically during the course of a match, it would seem Tana is consistently able to break him down mentally. This is what happens when you have a rivalry of this magnitude for such a long time. No matter how many times Okada proves himself, he will never get the big reactions that Tanahashi gets. Okada may be the face of the promotion but until the day he retires, Tanahashi will be the heart. Don Callis even mentions this at one point, noting that crowd’s energy must drive Okada and Gedo insane.---Tanahashi feeds off the palpable electricity of the crowd and hits a dropkick. He follows up with a basement dropkick and now it’s clear Tana is working over Okada’s knee. This is perhaps so Okada won’t be able to hit his signature dropkick, which is usually the turning point of his matches. Okada uses his speed to counter Tana’s slingblade with a lariat. Okada is limping at this point but maintains control. When Okada is focused, his offense is too quick for Tana to handle. The Rainmaker hits a neckbreaker followed by a top rope elbow dive. Okada hits his signature pose and posies for a -I-Rainmaker-E-. Tana leaps to his feet and the two smile and talk to one another. Tana reassures him that he has not done enough to end the match yet. Tana then hits a Dragon screw followed by a -I-High Fly Flow-E- to the outside. Perhaps waiting too long to follow up, Tana runs towards Okada on the outside and is hit with a tombstone to the floor. Both men have taken a beating and they lie on the floor alongside one another.---It is at this point that the match goes the into the trademark New Japan Main Event style and shifts into another gear. The camera captures a few shots of women crying in the crowd, if it’s any indication what Tanahashi means to the fans. Red Shoes counts to 19 as Tana just makes it back into the ring: New Japan does this spot a lot, but it hasn’t lost its effect quite yet. Kevin Kelly notes that they have past the 20 minute mark. The crowd is electric.---The two exchange strikes on their knees. Gedo sounds nervous at ringside, as he is ordering Okada to put Tana away. Tana and Okada trade strikes for the next three minutes both gaining  the upper hand at times just for the other to dig deep inside and stand back up. Tana feeds off the crowd to land the final blow, sending Okada to his knees. This is the equivalent of a home team performance during playoff basketball. If the Cleveland Cavaliers play The Golden State Warriors in Cleveland, then it’s no secret Lebron James is going to score more often than not on the fastbreak, feeding off the excitement and cheers of the crowd. With the crowd willing him back up to his feet every time, Tanahashi is going to land the last blow in a heated exchange.---Tanahashi capitalizes on the momentum and counters a drop kick with two Dragon screws. If there is any chance of him winning the belt and ending the 600+ day reign of Okada, while defending his 11 title defences record, it is at this exact moment. He goes for the cover.--- Okada kicks out at 2.---Tana is not deterred and runs for the top rope and goes for another -I-High Fly Flow-E-. Okada rolls out of the way and Tana crashes to the mat. The Rainmaker has exclusively been in high stakes matches the past couple of years, so in moments like this it would seem his intuition is among the best in the business.---Okada hits his signature drop kick twice, hitting Tana on the neck. Both times the crowd gasps, as they know what might follow. They are right, as Okada attempts to end it with a -I-Rainmaker-E- which Tana miraculously counters with a Dragon screw. The crowd breaks out in “Tanahashi” chants. The two lay on the mat as the weight of the moment sets in. Whoever digs deeper in the next few minutes will walk out the champion.---Okada attempts a tombstone but lacks the strength. Tanahashi breaks free, however, Okada capitalizes with a dropkick to the chest. The smarmy smile and arrogance washes over the face of Okada yet again. He feels that he has exhausted Tana and outlasted him to the finish line. The story we’ve seen a thousands times plays out yet again.---Okada loses focus and Tana takes attacks in that short window of time with a tombstone of his own. To answer my previous question, maybe Okada will never learn. Tana hits a -I-High Fly Flow-E- to the back of Okada. Correction from earlier, -B-this-E- is the moment in which Tanahashi has a chance to win the belt. He goes for second -I-High Fly Flow-E- but Okada counters with knees up. The match hits the 30 minute mark.---After a failed -I-Rainmaker-E- attempt, Okada lands a bridging suplex for a one count. A one count. The crowd erupts as Tanahashi storms to his feet. Okada is flustered and foolishly goes for the -I-Rainmaker-E- again. Tana hits a dragon suplex. Both men refuse to quit as Okada hits a drop kick and is then hit by a slingblade. Tana is too slow with a crossbody -I-High Fly Flow-E- and eats a drop kick in mid-air. Okada belches out his signature yell and attempts another -I-Rainmaker-E- but Tanahashi counters with his own -I-Rainmaker-E-. Can Tana win such a high stakes match with Okada’s own move?---The answer is no, as Okada kicks out at one. Tanahashi may have made a critical mistake by going for a move that isn’t his. Slaps are exchanged on the feet. Tanahashi counters a -I-Rainmaker-E- with a slap, however, Okada maintains wrist control until he is slapped one too many times, and collapses. Tanahashi pulls Okada up and hits the ropes, presumably for a sling blade, however, Okada grabs his trunks and turns him around for his second successful -I-Rainmaker-E- of the match. He covers Tanahashi for a three count.---The record now stands at 5-4-2 in Okada’s favor and he breaks Tanahashi’s record of 11 title defences.---This match was fucking great. As all Tanahashi and Okada matches go, the excellence was found in the details. No pair in the world are better at big matches than these two. A very strong Match of the Year contender emerges in the main event tonight.--- -B-This is Not a False Alarm: Okada vs Omega IV-E- ---Okada basks in the most important victory of his career. For a moment. When given the mic, Okada recounts his impressive list of vanquished foes. A list with the following names: Tetsuya Naito, Naomichi Marufuji, Kenny Omega, Minoru Suzuki,  Katsuyori Shibata, Bad Luck Fale, Cody, EVIL, Sanada, Zack Sabre Jr, and Hiroshi Tanahashi. Someone named Django joined Kevin Kelly and Don Callis on commentary to help translate Okada’s victory speech. Kelly has since stated on Twitter that Django will join their booth to help translate for further shows. I’m normally a fan of the two man booth but I’ve been long awaiting someone that can translate effectively, so I approve of the decision.---The Rainmaker mentions that only one man brought him to a draw. The crowd reacts big time. Okada calls Kenny Omega to the ring.---",
		"img_4": {
			"alt": "",
			"src": "content/wrd-21-5.jpg"
		},
		"body_5": "Omega hits the ring. Okada requests a match with no time limit. Kenny accepts, under the condition that it be two out of three falls. Okada accepts. And just like that, it’s on. June 9th. -I-Dominion-E-. One year later in the same building as the infamous time limit draw. I will save writing about how deliriously happy this makes me for the -I-Dominion-E- preview.---This was a hell of a show. Okada and Tanahashi put on an all-time classic. Jericho returned to set up a match with Naito. Omega vs Okada IV is a very real thing happening in just over a month. Oh, then it’s G1 season, but let’s not get ahead of ourselves. -B-What’s Next-E- --- Best of the Super Juniors. That’s what. Confirmed entrants are as follows: Will Ospreay, Hiromu Takahashi, KUSHIDA, Marty Scurll, Flip Gordon, Dragon Lee, BUSHI, Sho, Yoh, Ryusuke Taguchi, Tiger Mask IV, El Desperado, and Yoshinobu Kanemaru (thanks to www.f4online.com).---This fills out 15 of the 18 who will be participating in the tournament, which has dates running from 5/18 to the finals on 6/4, which will take place at Korakuen Hall. The last two dates, on 3rd and 4th of June will have English commentary. My guesses for the other three participants are ACH, Bone Soldier, and one more person from CMLL.---Lion’s Project 12 takes place on May 15th. The match card is as follows: Yota Tsuji vs Yuya Uemura, Manabu Nakanishi vs Tomoyuki Oka, Hiro Saito and Hiroyoshi Tenzan vs Ryusuke Taguchi and Ren Narita, Shota Umino vs Daisuke Sekimoto, and Yugi Nagata vs Ayato Yoshida.---Back to tonight. This was a hell of a show. Okada and Tanahashi put on an all-time classic. Jericho returned to set up a match with Naito. Omega vs Okada IV is a very real thing happening in just over a month. Oh, then it’s G1 season, but let’s not get ahead of ourselves. Allow me to sum up my sentiments about the show with one image:---",
		"img_5": {
			"alt": "",
			"src": "content/wrd-21-1.jpg"
		},
		"soundcloud": "",
		"youtube": "",
		"show_portfolio": false,
		"show_blog": true
	}]
}
