{
	"article": [{
		"title_short": "THE SIGNIFICANCE OF SHENMUE",
		"title_long": "THE SIGNIFICANCE OF SHENMUE",
		"author": "Trevor C. Goodchild",
		"read_time": "4 min read",
		"pub_date": "16 Aug 2014",
		"theme": "ccard_tall",
		"summary_quote": "Shenmue never fails to give me a nostalgic twinge",
		"tags": [
			"GAMES",
			"WRESTLING",
			"MOVIES",
			"COMICS",
			"GEAR"
		],
		"body_1": "-HR-Whenever I look back at the copious amount of games I played growing up, Shenmue never fails to give me a nostalgic twinge. It's a unique experience that I've yet to see replicated in any other game. The mix of an enthralling story and detailed atmosphere make for an engrossing and mystifying experience. At its core, Shenmue is a murder-mystery story that is augmented by incredible atmosphere and a plethora of side quests that adds depth to the narrative and contributes to the universe. Thread by thread, every character you meet has a unique personality that architects a fascinating interwoven back-story. Every aspect of Shenmue's gameplay was revolutionary at the time and included many gameplay mechanics that we take for granted in modern games. It introduced day and night cycles with the clock always ticking and quick time events that helped players interact with cut scenes. Perhaps its greatest technical achievement, Shenmue ushered in the idea of fully voiced NPCs (Non-Playable Characters) with daily routines.",
		"img_1": {
			"alt": "Shenmue",
			"src": "/content/wrd-2-1.jpg"
		},
		"body_2": "After its release, Shenmue was no doubt the touchstone for what an open world game should be. Shenmue holds up well relative to other games of its generation. It's one of the healthier folks at the Sega retirement home, who occasionally may need a cane to hold itself up. The graphics may seem dated to someone who doesn't play older games; however, there's no denying that it clearly a took a lot of resources to make (it was, in fact, the biggest budgeted game of its time). The leap in graphics it made is arguably the greatest leap in all of gaming's history.",
		"img_2": {
			"alt": "Karate",
			"src": "/content/wrd-2-2.jpg"
		},
		"body_3": "Yu Suzuki, the man behind Shenmue, had an incredible story that was never fully realized. This was due to an enormous budget and disappointing sales. After only two games, and an unresolved story, Shenmue halted production and left its dedicated fans to wallow in a pool of false rumors and sparse glimmers of hope for years to come.",
		"img_3": {
			"alt": "",
			"src": "/content/wrd-2-3.gif"
		}, 
		"body_4": "",
		"img_4": {
			"alt": "",
			"src": ""
		},
		"body_5": "",
		"img_5": {
			"alt": "",
			"src": ""
		},
		"soundcloud": "",
		"youtube": "WmpUMOiIMyQ"
	}]
}
