{
	"article": [{
		"title_short": "YOU SHOULD WATCH GAMECENTER CX",
		"title_long": "YOU SHOULD WATCH GAMECENTER CX",
		"author": "Nick",
		"read_time": "2 min read",
		"pub_date": "8/4/2014",
		"theme": "ccard_tall",
		"summary_quote": "A Japanese show about, you guessed it, video games",
		"caption": "",
		"caption_class": "",
		"tags": [
"MOVIES",
"LOL",
"TECH",
"COMICS",
"DESIGN",
"GAMES",
"GEAR",
"MOVIES",
"SOCIAL",
"WRESTLING"
		],
		"body_1": "For those unfamiliar with Gamecenter CX, (or Retro Game Master, as it's known to the rest of the world) it's a Japanese show about, you guessed it, video games.",
		"img_1": {
			"alt": "GAMECENTER CX",
			"src": "http://66.media.tumblr.com/087318f2596a01475e171ced22bf1bf4/tumblr_inline_nazor3e9f81smmq8b.jpg"
		},
		"body_2": "It goes a little something like this: Shinya Arino, a popular Japanese comedian, is tasked with beating a retro video game in one day (the humor often originating from the fact that he isn't very good at games). This challenge, interrupted periodically by other game-related segments, comprises one episode. Generally, his goal is to reach the conclusion of the game by the end of a single work day. If the challenge proves to be too difficult, Arino can call for an extension, which allows him to save his progress and return to playing at a later date. An extension occasionally breaks the episode in two parts. Additionally, he can rely on his ADs, or Assistant Directors, to aid him in completion. The ADs are responsible for having an in-depth understanding of the game at hand. When he feels his pride is at stake, sore thumbs be damned, Arino will often opt out of any external help. It is not uncommon for him to spend multiple hours on a single level.",
		"img_2": {
			"alt": "",
			"src": "http://68.media.tumblr.com/a0854e5313609f0faddeebe0064762d5/tumblr_inline_nazorfkpJR1smmq8b.jpg"
		},
		"body_3": "The original concept of Gamecenter was to have Arino interview different game companies. After the first season, the focus of the show shifted purely to him trying to beat games (Also note: this is the only time in the history of the show that he plays any console that succeeds the original Playstation).",
		"img_3": {
			"alt": "",
			"src": ""
		},
		"body_4": "There's no doubt that GCCX has built up quite the following in Japan. It currently boasts eighteen seasons, numerous live specials, three video games, and even a movie! Despite the attempted localization project spearheaded by Kotaku, Gamecenter CX never caught wind in the states. Some blame has been thrown in the direction of Kotaku for failing to translate the show properly (e.g., poor dubbing, the removal of music and certain segments, etc). Don't let this get you down! There is a light at the end of the tunnel for English speaking fans such as myself. There are number of fan groups that are currently translating episodes of GCCX and most importantly, staying true to the shows original Japanese presentation. People behind websites like GamingCX deserve all the love in the world for what they're doing.<br><br>As someone who loves both video games and television, I find it incredibly disappointing that we don't have something like GCCX here in the west. Sure, you can watch people play games on YouTube and Twitch; however, simply put, the experience isn't quite the same. The magic isn't there. I'm hopeful that it's only a matter of time until someone recognizes the novelty of a video-game-themed variety show whether it is on T.V. or the web.",
		"img_4": {
			"alt": "",
			"src": ""
		},
		"body_5": "",
		"img_5": {
			"alt": "",
			"src": ""
		},
		"soundcloud": "",
		"youtube": "",
		"show_portfolio": false,
		"show_blog": true
	}]
}
