{
	"article": [{
		"title_short": "Payback",
		"title_long": "Payback",
		"author": "Nicholas Krause",
		"read_time": "15 min read",
		"pub_date": "01 May 2017",
		"theme": "",
		"summary_quote": "It's all about that sweet sweet...revenge",
		"tags": [
			"WRESTLING",
			"GAMES",
			"MOVIES",
			"COMICS",
			"GEAR"
		],
		"body_1": "“A night about revenge, ladies and gentlemen”, shouts Michael Cole at some point during the RAW exclusive Payback event last night in San Jose, California. Dammit Cole, I think you meant it’s a night about...nevermind. Moving on. Did you know there was a WWE pay-per-view last night? Well there was. Although the go-home show for RAW last week hardly did anything to sell last night’s show, here we are. With the non-title match between Smackdown’s Randy Orton and RAW’s Bray Wyatt, a no show for the universal champion Brock Lesnar, and the confusing stipulations with Chris Jericho and Kevin Owens rematch, I hardly know what is going on. Even for WWE’s standards, the stories are way too convoluted.---Just under one month from Wrestlemania 34, Payback is the first payperview after the largest event of the year. It’s also the first payperview after the “Superstar Shakeup”, or rather, the two nights in which we switch up some of the talent while totally shattering the illusion that the management of the two brands are strategically bargaining for the company’s top talent as opposed to randomly sending wrestlers back and forth on a moment’s notice. A stark difference from this time last year, in which a proper draft was held with the main storyline being the two brands attempting to establish dominance with a superior roster. With one month being the time period for a free subscription to the WWE network, many thousands of lapsed WWE fans were treated to Payback as part of their free trial: This event was even promoted before and during Wrestlemania, as in “Hey! Sign up for a WWE network trial today and not only will you get Wrestlemania free, you’ll get the RAW exclusive Payback show for free!”. You know, the Payback show that featured neither of the world championships, isn’t exclusive to the RAW brand, and consisted of many rematches from the Wrestlemania card. Credit where credit is due, Payback ended up being a solid show, totally in spite of its buildup and nonsensical storylines. Let’s talk about some of the highlights.---The good:",
		"img_1": {
			"alt": "",
			"src": ""
		},
		"body_2": "Chris Jericho vs. Kevin Owens---The show opens with Chris Jericho and Kevin Owens’ rematch for the United States championship. Over half a year into the biggest storyline on RAW, in which best friends become bitter enemies, it seems like the once great feud, and the shining beacon of RAW for many months, is beginning to fizzle out. On paper, the matchup seems great but the series of matches between the two suffers quite a bit for a few reasons. The shift from the main event scene, having Universal belt taken out of the picture, I think, is chief among them. Their first match being early in the fucking 7 hour long Wrestlemania also hurt the feud quite a bit. Not to mention, AJ styles already won a number one contender's match for the United States belt on Smackdown, dating this rivalry definitely. Those things could be forgiven, however, the storytelling the last few weeks has to led to equal parts confusion and disinterest on my end. If Chris wins, he’s headed to Smackdown alongside Kevin and if Kevin wins, he keeps his belt and keeps his distance from Chris, being the only one of the two on Smackdown. In reality, however, we all know Chris is leaving the company for the indefinite future to tour with his band. He promoted his tour heavily online with his first date being in about a week. Chris’ departure deflated my interest in the match quite a bit. Last night, at Payback, the two put on the longest match of the night at around 18 minutes.They built on their storyline, having Kevin escape trouble by touching the ropes with his finger for the second time, the first being at Mania. The single finger on the ropes was probably my favorite spot of the entire Wrestlemania card, so I had no problem with them continuing that story. Chris grew frustrated and demolished Kevin’s finger by trapping it between the ring and steel steps and kicking the shit out of Kevin’s arm. The match culmanated with Kevin regaining his footing but ultimately failing to secure his pop up powerbomb and wincing in pain due to his finger. Chris then secured the win in a clean, surprising upset, making him a two-time United States champion. I’m all for the upset win, and knowing Chris’ circumstances with his band commitments led to me being genuinely surprised, although I would suspect he’s going to drop the belt this Tuesday, as is departure is days away. That probably means one more segment, and perhaps one last match between him and Kevin on Smackdown to end this 8 month feud. All in all, the Kevin Owens and Chris Jericho story has been tons of fun and one of the best built feuds of the last year, and although it once promised much more, like a Universal championship match at Mania, I can’t complain overall. The match tonight was similar in quality, if not a little better than their Mania match, and despite being the first match, didn’t suffer from its placement on the card nearly as much as at Wrestlemania.---Austin Aries vs. Neville---Two of the best wrestlers in the company put on my favorite match of the night. Yet another Wrestlemania rematch, this one feels justified as Austin won a number one contenders match a few weeks ago and Neville has decimated all other potential foes over the course of his monster run the last three months. The two did well at Wrestlemania, hindered by their placement on the pre-show and the fact that people were still filing in the main show. Despite this, it still stood out to me as one of the better matches of that night. Tonight, not much is different but that’s okay, as these guys are entertaining as hell. Austin storms out of the gate and dominates the entire match, which ran about 10 minutes. Neville knows he is beat this time around, and after Aries secures his Last Chancery submission hold, Neville grabs at the referee's’ shirt instead of tapping, and retains via disqualification. Normally, I’d condemn such a fuck finish, but I want to see these two wrestle until the end of time. Speaking of time, that seems to be the crux of my disappointment with this feud. They are getting plenty of time on both RAW and 205 Live, in which they both consistently cut fantastic promos and put on entertaining matches, yet when it comes to the big shows like Wrestlemania and Payback, their matches aren’t given much time to breathe. This is a shame, as Aries is over massive with the crowd and Neville is one of the company’s few genuine heels and the only true heel in the cruiserweight division. I expect this will culminate in a rubber match at Great Balls of Fire (which is the name of the next RAW ppv and not, in fact, a sick joke). I want to see as much of these two as possible, so I’ll take the fuck finish happily.",
		"img_2": {
			"alt": "",
			"src": ""
		},
		"body_3": "Braun Strowman vs. Roman Reigns---Next to Jericho and Owens, Braun Strowman has been the best thing about RAW the last few months. Strowman is a proper monster, and booked as such. He reminds me of the WWF of old, in which the large, mean monsters posed a threat to everybody in the locker room. From flipping ambulances, to breaking the ring, to throwing people in dumpsters off the ramp, no one, not even management, can stop the monster among men. It’s simple booking, but the monster heel is an art that WWE largely have forgot over the last few years. After his decimation of Roman Reigns, in one of the greatest RAW segments of the past decade, the crowd was on fire for this main event. Storyline be damned, after being nearly murdered by Strowman three weeks prior, Roman seemed eager to fight. They at least pretended he wasn’t fit for a match, by having Roman be bandaged up to such a degree that he reminded me of the mummy from Halloween Havoc 1995. The match itself was my second favorite of the night, largely due to the post fight sequence. The two go back and forth, the story being that Roman is battered as hell from the vicious ambulance attack. The crowd, as usual, is willing to boo Roman out of building but they were the hottest they’ve been all night for this match. The ending sequence becomes lopsided in favor of Braun, however, Reigns scored a spear that looked like it could be the end. Braun kicks out and gets the clean and very rare win over Reigns. Fans can boo as much as they want, but Roman is one of the best workers in the world right now and absolutely deserves to be in the main event picture, no one gets the reaction that he does, and that’s what’s important to them--a reaction. After the clean win, Braun does Braun things and punishes Roman even further. In what is a gnarly spot, Strowman takes a steel step and smashes it against a flattened Reigns’ stomach. He taunts to the crowd and as the camera returns to Reigns, he is pouring blood from his mouth, insinuating internal injuries.The officials then come out, screaming for an EMT as Braun exits the ring. Roman, against the wishes of the refs and doctors, walks out on his own accord stumbling and pouring blood from his mouth. This signals the end of the show, however, things continue for a few more moments on the network. Once the camera’s are back on, Roman is spitting blood on the wall and slowly makes his way to the back of an ambulance. Braun emerges with his signature line, screaming, “I’m not done with you yet!”, which is equal parts hilarious and terrifying. Reigns, despite seemingly slowly dying, jukes a charging Strowman and Strowman crashes into the ambulance door, taking it off its hinges, and falls into a wall of conveniently placed boxes. This entire match and following segment were done to perfection and made the entire show worth watching. Braun came off a massive monster and Roman the resilient warrior. Well done WWE. I would think the next step is to have Braun face Brock for the belt, which should be great, until Reigns makes his return and eventually start his actual feud with Brock.---The Bad:---Randy Orton vs. Bray Wyatt in a non-title House of Horrors match---Well, we learned just what the fuck a house of horrors match is. Remember the Wyatt vs. New Day fight at the Wyatt compound? If you’re unfortunate enough to remember that, then you probably groaned just as I did when they rolled the pre taped footage last night. Since losing the belt at Wrestlemania, Bray Wyatt has been drafted to RAW, while Orton is remaining on Smackdown. Orton has found a new challenger in the form of Jinder Mahal at BackLash (insert a thousand jokes here), but Wyatt wants his rematch in the most Wyatt way possible, a way that perfectly encapsulates Wyatt’s entire run: A cool idea executed horribly. In regards to the storyline, this makes no fucking sense. After losing cleanly at Mania and switching brands, Wyatt is granted a non-title match with Smackdown’s Orton, on a RAW show. Ridiculous. The pre taped footage starts with a shirtless, blue jean clad Orton in Limo arriving at Wyatt’s “house of horrors”, or rather a low-income house decorated with True Detective props. At this point, I’m still into the idea. Orton enters the house, many cuts of strange objects laid everywhere. Wyatt emerges in a wife beater, completed the low-income, white trash look and feel they were totally going for. You know, instead of  a demented playground erected by a demonic man hellbent on destroying Orton. It is at this point that I am very much not into the idea of this match. What a difference two minutes makes. The two brawl and brawl and brawl and….brawl. Finally, Wyatt tips over a fridge on Orton, bails in the Limo that Orton arrived in, and heads for the Arena. It’s dark outside. It is not dark outside where the arena is in San Jose. Jesus fucking Christ WWE. The camera cuts back to the announcers, who exclaim their horror at what they just witnessed, while a bolstering choir of boos occur in the background. The fans were expressing an entirely different type of horror, I’m sure they didn’t appreciate sitting in the arena and starting at the screen for 10+ minutes. The Seth Rollins vs. Samoa Joe match happens, and finally, roughly 20 minutes later, Wyatt arrives at the arena. He does his normal entrance which is extremely weird, as he was supposed to have just been in a grueling fight. Then when he reaches the ring, Orton appears behind him. Magic. That’s the only way I could describe how Orton would go from being pinned under a fridge in a house to getting to the area before Wyatt, who left in a limo. The two then fight for a few minutes before the Bollywood Boyz, or whatever the hell they are called now, and Jinder Mahal, interfere and hit Orton with his own belt, allowing Bray to hit the Sister Abigail and the pin. There you have it, Wyatt gets his revenge after three people interfere in a nothing match that killed the flow of the show and Orton is still champion because this was non-title match. The crowd wasn't having it and no one won here.---Bayley vs Alexa Bliss for the RAW Women’s Championship---Bayley comes out to a massive reaction in her hometown of San Jose. She gets the biggest pop of the night and everyone loves them some Bayley. A dream scenario for WWE, who have trouble getting people over as babyfaces. Their natural reaction in light of this is to have Bayley lose the belt. In her hometown. Alexa Bliss is a great character and solid in the ring, but this was not the time to pull the trigger on her win. The women’s division is thin on RAW, and this program could have continued on to the next PPV, with Alexa winning there. This was not the night. The match ran about ten minutes, with the story essentially being that the crowd fucking loves Bayley. As a kid, she saw her favorite wrestler Randy Savage in the same arena, and now she’s defending her belt there. The match wasn’t long but it was well done, the best women’s match in months. Almost no screwups, although the crowd died down a little after Bayley’s entrance, all they wanted was to see her win. That was not the case, however, and Alexa won She won cleanly. A horrible decision. The crowd didn’t recover all night until the main event. This was a strange case of the right type of match, the right opponent, the right storyline, the right place, but the wrong outcome. Babyface’s don’t need to lose in their hometown.",
		"img_3": {
			"alt": "",
			"src": ""
		}, 
		"body_4": "The rest:---Enzo and Cass faced Karl Anderson and Luke Gallows on the pre-show, in a match that we’ve seen many times on RAW the last couple months. With Sheamus and Cesaro and the Hardy Boyz fighting for the belts, the other tag teams are merely treading water. Speaking of Sheamus/Cesaro and the Hardys, they faced one another in a decent match tonight. The outcome surprising no one, with Team Extreme retaining. The only notable part of this match, was Sheamus kicking Jeff Hardy’s tooth out with a wildly nasty and unsafe shin to the jaw. Sheamus already has a reputation as an unsafe worker and this was just unsafe and irresponsible. I came here to see fake fighting, stop hurting people! The preshow also had a Miz TV segment with guest Finn Balor. It ended as usual, with Finn beating the shit out of the Miz. Both these guys are great and hopefully they can keep doing stuff together until Balor makes his way back up the title scene. He even hinted at such, saying he wanted his belt back. Seth Rollins faced Samoa Joe in a match that would have otherwise been much better, but had a dead a crowd due to being in the middle of the horrible House of Horrors shenanigans. Seth sold his injured knee very well except for when he decided not to, and unload his usual repertoire of high-risk moves. He eventually got the win over Joe, but that was the expected income. The whole feud seems like filler until Seth moves on the main event scene again or finds someone else to fight.---Payback suffered from a ton of nonsensical post-Wrestlemania and superstar shakeup storylines, and aside from the brutal Strowman and Reigns ambulance angle, didn’t do much to sell me on the show. In fact, I almost forgot entirely about the show but ultimately decided to watch last minute. I’m glad I did. After Wrestlemania, it’s nice to have a non seven hour slog fest and some really solid wrestling. I can’t say this renewed my interest in RAW, of which there has been none all year, with all I’m looking forward to is the Braun Strowman vs Brock Lesnar in June/July and whatever they do with Balor in the meantime.",
		"img_4": {
			"alt": "",
			"src": ""
		},
		"body_5": "",
		"img_5": {
			"alt": "",
			"src": ""
		},
		"soundcloud": "",
		"youtube": "",
		"show_portfolio": false,
		"show_blog": true
	}]
}
