{
	"article": [{
		"title_short": "5/1/17 RAW Thoughts",
		"title_long": "5/1/17 RAW Thoughts",
		"author": "Nick",
		"read_time": "10 min read",
		"pub_date": "05/02/2017",
		"theme": "",
		"summary_quote": "Back to you, Gorilla!",
		"tags": [
"LOL",
"TECH",
"COMICS",
"DESIGN",
"GAMES",
"GEAR",
"MOVIES",
"SOCIAL",
"WRESTLING"
		],
		"body_1": "The big red reset button was hit last evening on Monday night RAW. The storm known as Payback has washed away with its nonsensical stories and numerous Wrestlemania rematches. The next batch of feuds were revealed and we now have a sense of the general direction of the RAW brand going into Summer. It was a decent show saved by an entertaining main event. Let’s get into it.",
		"img_1": {
			"alt": "wrestling",
			"src": "/content/wrd-9-1.jpg"
		},
		"body_2": "Alexa Bliss is a goddess (it’s true)---The entire women’s division, who I can count on two hands, is out for a promo that has the new champion, Alexa Bliss, perched on an elevated pedestal above her wrestling peers. Alexa looks damn good with the belt and her facial expressions and smug demeanor are perfect as always. Alexa Bliss is amazing(it’s damn true). She cuts a promo on a few of the women, with an emphasis on Nia (hey you’re the big girl, we’re friends right?), Sasha, and of course, Bayley. Alexa fumbles a bit on the mic but I get the feeling she will find her footing verbally in the near future. After burying almost everyone else in the ring, Alexa is pushed off her pedestal by Bayley and attacked by the entire division. A tag match is made and that’s about it. Hey, the sequence of events is a lot better than the women’s division usually gets, so I’ll take it. The finish of the tag match was a bit surprising, with Alexa pinning Bayley clean for the second night in a row. It seems the feud between the two is done for the time being, with Sasha looking like the next contender: Sasha was the last of the group to pin Alexa Bliss two weeks ago. I have both positive and negative feelings about this. The entire feud with Bayley was done totally incorrectly. Again, having Bayley lose in her hometown was the wrong decision. However, what’s done is done and it’s time to move on.",
		"img_2": {
			"alt": "",
			"src": ""
		},
		"body_3": "Dean Ambrose the Interviewer---The storyline of the night revolves around the Intercontinental champ Ambrose, and his willingness to defend his belt at any time and place. With Lesnar’s absence, Ambrose declares his belt the top belt of the brand and he’s not wrong. Finn Balor and Seth Rollins both deserve shots at Lesnar, as Balor never lost his Universal championship and Rollins never got the one on one rematch with Brock. The Miz is in the picture mostly because they need a heel and he was the previous Intercontinental champion. He reminds Dean that he was the one to bring relevancy to the belt and that Dean wasn't important enough to defend it at Payback. I often find that creative mirrors how management feels in their writing, so that’s probably not a great sign regarding people’s feelings towards Ambrose at the moment. I could be wrong because Ambrose happened to be the star of the night, involved in most backstage segments and he’s the top babyface of the show until Roman is back. A three way is set between Rollins, Balor, and the Miz to determine the number one contender in the main event. Ambrose interviews the three over the course of the night in some pretty humorous segments, mostly because Ambrose signed off in classic WWF interview fashion, as in “back to you Gene” and “back to you Gorilla”. I appreciated that. ",
		"img_3": {
			"alt": "",
			"src": ""
		},
		"body_4": "Finn Balor vs Seth Rollins vs The Miz with exclusive guest Fuck Finish---The main event tonight was great. There is no obvious winner and that was clear by the crowds reactions. The Miz gets some decent heat the usual way by using his wife as a human shield and stalling outside the ring at multiple points. Seth and Finn do the heavy lifting and throw every move they have at one another. The buildup and last five minutes of this match made Seth and Finn look like superstars. A massive win for the two, this main event showcased why both of them are making their way back up to the top of the main event scene. Seth only did a bit of his typical knee selling but threw it out the window yet again by flying high at every chance he got. Despite this, he really got over with what was probably his first real instance of true babyface fire towards the end of the match. He was beaten down, he was tired, he was frustrated, but he wasn’t giving up. The crowd went nuts for him. It’s so awesome to see, because true babyface fire is rare in WWE as of late. The winding down moments of the match made it seem like someone was going to go over clean but this was not the case, as Samoa Joe emerged from the crowd to plant Seth, taking him out of the picture. Balor has Miz beat but Wyatt’s fucked up imagery hits and he emerges from under the ring to cost Balor the match. The Miz pins Finn and is the new number contender. I’m not a fan of the fuck finish, especially since this match had people more excited than other match last night at Payback. This was just the way to establish the upcoming feuds while making everyone, except the Miz, look strong. Now we know the feuds going forward are Lesnar/Strowman until Roman is back, Miz/Ambrose, Balor/Wyatt and Seth/Joe.---It should be a fun few weeks.",
		"img_4": {
			"alt": "",
			"src": ""
		},
		"body_5": "",
		"img_5": {
			"alt": "",
			"src": ""
		},
		"soundcloud": "",
		"youtube": "",
		"show_portfolio": false,
		"show_blog": true
	}]
}
