{
	"article": [{
		"title_short": "The Future is Evil",
		"title_long": "The Future is Evil",
		"author": "Nick",
		"read_time": "10 min read",
		"pub_date": "10/19/2017",
		"theme": "",
		"summary_quote": "Happy Halloween!",
		"caption": "The Future is EVIL",
		"caption_class": "ccard-caption",
		"tags": [
"WRESTLING",
"LOL",
"TECH",
"COMICS",
"DESIGN",
"GAMES",
"GEAR",
"MOVIES",
"SOCIAL",
"WRESTLING"
		],
		"body_1": "EVIL is a badass. Does his entrance gear look straight out of a Costume City? Yes. Is EVIL a terrible name for a wrestler? Absolutely. EVIL possess a presence that forgives these things and as of late, he’s looked to be headed in the direction of a upper midcard guy, with a chance to be more. Between his G1 and King of Pro Wrestling performances, things are mostly looking up for the purple-haired, eyeliner clad villain.---Hello",
		"img_1": {
			"alt": "",
			"src": ""
		},
		"body_2": "-B-The G1 is EVIL-E- ---The G1 Climax 27 served many purposes. It worked to get Naito over as the top contender in the company and allowed the stars to align regarding his immense popularity and his position on the card. This win firmly placed the punctuation on his star power and positions him to challenge Okada not only for the title at Wrestle Kingdom, but for the right to be the ace of the company. For that purpose, this G1 worked quite well, as it’s designed to do.--- The rest acts as vehicle to display the remainder of the heavyweight talent and allow the fans to decide who to care about going forward. There were many stories at play during this G1. Stories including: Omega vs Okada III, Yugi Nagata’s final tournament run, the G1 debuts of Zack Sabre Jr and Kota Ibushi, and Tanahashi fighting through a bicep injury while trying to keep up with the younger talent.---My favorite story in the tournament came in the form of the two Los Ingobernables prospects: EVIL and Sanada. The big question prior to the G1 Climax 27 was which Los Ingobernables member would break out during the tournament, and with all the action in rear-view mirror, the answer is clearly EVIL. This was in part due to booking, as all matters are in wrestling, but make no mistake, EVIL performed exactly as he needed to. Let’s put that thought on hold and discuss the circumstances that lead to the importance of EVIL’s G1 run.--- Everyone that watches and follows the G1 blocks knows that the format allows for otherwise protected wrestlers (e.g., Okada, Naito, Tanahashi, Omega), to be susceptible to losses. This is just the nature of having nine matches over the course of a few weeks. No one is invincible. Not even Okada. ---Picture of Okada---",
		"img_2": {
			"alt": "",
			"src": ""
		},
		"body_3": "Okada’s dominance as champion over the last year is an entirely different story, however, what's relevant here is the fact that the champion hasn’t been pinned roughly a year. Whether it be in an instant-classic type of main event or even a typical undercard tag, the man has not be pinned in a longer period than most WWE champions even hold their belts. It’s an simple, yet impressive form of long term wrestling storytelling.---Once the G1 Climax 7 rolled in, this changed. Despite drawing with Suzuki and eventually losing to Omega, Okada’s first loss in a rough tournament was handed to him by EVIL. It was shocking. It was done well. It was done by the right person. Once I saw this, I knew EVIL was the right choice. I knew EVIL would descend upon New Japan in a stream of thick, black eyeliner and cheesy “spooky” promo videos. I was firmly on board the EVIL bandwagon.",
		"img_3": {
			"alt": "",
			"src": ""
		},
		"body_4": "",
		"img_4": {
			"alt": "",
			"src": ""
		},
		"body_5": "",
		"img_5": {
			"alt": "",
			"src": ""
		},
		"soundcloud": "",
		"youtube": "",
		"show_portfolio": false,
		"show_blog": true
	}]
}
