{
	"article": [{
		"title_short": "The origins of Arcanus 55 and the Trials of Realizing a Tech Startup",
		"title_long": "The origins of Arcanus 55 and the Trials of Realizing a Tech Startup",
		"author": "Nick",
		"read_time": "15 min read",
		"pub_date": "04/15/2018",
		"theme": "",
		"summary_quote": "This article covers my experience launching my own tech startup",
		"caption": "",
		"caption_class": "",
		"tags": [
"TECH",
"LOL",
"SOCIAL",
"COMICS",
"DESIGN",
"GAMES",
"GEAR",
"MOVIES",
"SOCIAL",
"WRESTLING"
		],
		"body_1": "The motivation behind Arcanus 55 emerged from a conversation with a coworker regarding cryptocurrency security. We both were early cryptocurrency adopters and I found myself becoming nervous about keeping my investments in an exchange, like Coinbase. It’s not uncommon to hear horror stories from crypto investors about opportunities lost due to exchanges. There have been some very public examples of hacks and embezzlement surrounding these exchanges. Together my coworker and I did some online shopping and perused the popular hardware wallets. I just didn’t feel comfortable buying one of these online due to a few common denominators.",
		"img_1": {
			"alt": "",
			"src": "/content/wrd-22-1.jpg"
		},
		"body_2": "All of these secure USB manufacturers were located outside of the United States. As it stood with ordering one: they were expensive, they were back-ordered, and they had to be imported from a different country. It was here that I begun to see a need that wasn’t being fulfilled. I realized the need for the average person to possess a tool that would provide adequate security of their digital assets. This solution existed in pieces, but no one has taken the effort to combine them into one holistic solution.---The early adopters of cryptocurrency tended to be technical nerds. These people were comfortable with encryption and information security best practices, however, the burgining hoard of new investors were not so savvy. There was clearly a need that Arcanus 55 could address.---Arcanus 55 is a practical multi-layer defense against realistic threats while still making its precious payload accessible. The device is 256-bit AES encrypted and onboard keypad PIN authenticated: Data is encrypted on the fly and the data remains encrypted while the drive is at rest. This hardened drive has brute-force defense, unattended auto lock, and a self-destruct PIN. It strikes the right balance between security and usability. Your private documents and keys are safely encrypted on removable media.--- A integrated virtual keyboard protects your credentials in real-time. It has many advantages as a cold storage medium. Recording mnemonic phrases on paper is considered the most secure method of protecting private keys from hackers, however, unlike paper, Arcanus 55 cannot be compromised by simply looking at it. It is a myth that paper is safer than digital. While it is true paper cannot be hacked, it is easily lost, burnt, or simply photographed.  An attacker with no technical skill can easily compromise paper or etched steel.",
		"img_2": {
			"alt": "",
			"src": "/content/wrd-22-2.jpg"
		},
		"body_3": "Arcanus 55 goes beyond by providing physical protection against accidental loss or damage. The A55 capsule is an extremely reliable, airtight, waterproof, crushproof, and tamper evident physical shield for your digital wealth. It’s your “Digital Jump Bag”. Accidents do indeed happen, and sometimes you can be the greatest threat to your own assets. The capsule protects it from everyday accidents like a coffee spill or a ride in the washing machine in the pocket of your jeans. Holding the A55 Capsule gives you a feeling of value, like a bar of gold. Not something that would accidently slide between the sofa cushions.",
		"img_3": {
			"alt": "",
			"src": "/content/wrd-22-3.jpg"
		},
		"body_4": "www.Arcanus55.com is SPA (single-page application) that is optimized for organic SEO, mobile, accessibility, performance, and best practices.",
		"img_4": {
			"alt": "",
			"src": "/content/wrd-22-4.jpg"
		},
		"body_5": "When performing a google Lighthouse audit on the website, the returned numbers are quite high. For reference, a large eCommerce website like www.Walmart.com, boosts an overall performance score of 43.<br>Try it yourself if those numbers seem too good to be true. Visit any popular website and initiate a performance audit by first right-clicking anywhere on the page, select “Inspect”, and select “Audit” from the menu on the top bar. See how www.Arcanus55.com stacks up to all other eCommerce sites.---The high performance numbers shown on the Arcanus 55 website are indicative of a few important design principles. Primarily, the 100 SEO skill shows the complete utilization of search engine practices, for instance, a proper Sitemap that allows the Googlebot to crawl the site. Other tricks, like allowing the images on the website to be a part of the Sitemap, allows for more efficient Google web-crawling.---The Arcanus 55 website is designed to be a reactive website, meaning it natively scales to best fit the device it is viewed on, whether it be a desktop, tablet, or mobile phone. The idea of micro-moments was a leading principle behind the design. A micro-moment is the split the second when a potential customer decides to stay or leave a newly-found website. It is with this in mind, that a lot of consideration was put into exactly how long it takes the site to load: A matter of seconds is the difference between making or losing a sale. For instance, images on the website are compressed without losing a ton of quality, and this reduces the loading time by a whole second. Crafting the A55 mobile landing page around these principles means it is basically the exact experience of running a native smartphone application. Time is money when it comes to mobile, as people aren’t going to stick around to learn about something they know nothing about.---Arcanus 55 utilities lifestyle personas as a means of storytelling. We used realistic characters with realistic needs to depict the everyday applications of A55. This is done through engaging animation, audio, and video. The entire website is designed to be easily consumed without overwhelming details: The flow of the the customer experience is such that these details are exposed progressively leading to a stress-free sale (conversion). The entire website is single-page eCommerce package. It pitches the product in addition to allowing to add to cart and checkout without ever leaving the page.<br>A strong working knowledge of Google Adwords, analytics, tag manager, and lighthouse is what is required to effectively get the right eyes on the product page. The link located at: https://academy.exceedlms.com/profiles/nicholaskrause0641df37 displays my Google Adwords certifications (I also possess Bing search accredation). Adwords is a strong, complex part of a large marketing equation. At the risk of doubling the length of this article as it is, I will simply state that a lot of research, fine-tuning, and brand consideration goes into perfecting a Google Adwords campaign. For Arcanus 55, I best found that establishing separate search campaigns based around user cases was what worked best. This works in conjunction with the persona lifestyle means of storytelling: Different advertisements for the product are tailored to a different type of person with unique needs. For instance, some ads target people looking to move their digital wallets to a safe USB stick. Other advertisements target people that want a safe place to store their tax files in time for tax season.",
		"img_5": {
			"alt": "",
			"src": "/content/wrd-22-5.png"
		},
		"body_6": "",
		"img_6": {
			"alt": "",
			"src": "/content/wrd-22-6.jpg"
		},
		"body_7": "",
		"img_7": {
			"alt": "/content/wrd-22-7.jpg",
			"src": ""

		},
		"see_also_btn_1": ["Arcanus 55 Website","https://www.Arcanus55.com"],
		"see_also_btn_2": ["Google ADwords Cretificate Profile","https://academy.exceedlms.com/profiles/nicholaskrause0641df37"],
		"soundcloud": "",
		"youtube": "",
		"show_portfolio": true,
		"show_blog": false
	}]
}
