{
	"article": [{
		"title_short": "The NXT problem wrd3",
		"title_long": "NXT started as the developmental branch of WWE",
		"author": "Trevor C. Goodchild",
		"read_time": "3 min read",
		"pub_date": "7/4/1893",
		"theme": "",
		"summary_quote": "NXT started as the developmental branch of WWE",
		"tags": [
			"GAMES",
			"WRESTLING",
			"MOVIES",
			"COMICS",
			"GEAR"
		],
		"body_1": "Ideally I would've liked to start this article off by detailing what exactly NXT is. For those not in the know, NXT started as the developmental branch of WWE. World Wrestling Entertainment previously had many developmental territories under their umbrella, however, these organizations purposefully had minimal exposure and few ways for their developing talents to connect with potential fans. The formation of NXT, a proper developmental brand with both a weekly television and frequent touring, allowed new, fresh signees of the wrestling juggernaut's roster pool a chance to perform in front of moderate-sized crowds and hone their skills in the various wrestling crafts before debuting on the big stage. In hindsight, NXT seems like something that should've always been around. This, however, was not the case until late 2014. At that time, the new developmental brand was exactly like what someone trying to imagine it now would picture. It had some fresh blood right out of both the independent wrestling scene and the WWE performance center. It taped in front of relatively small crowds and it showcased some exciting wrestling with the obvious expected flaws of more green performers. This was alright, because at the time everyone knew what NXT was and more importantly, NXT knew what NXT was.",
		"img_1": {
			"alt": "Whaaaat",
			"src": "http://d2ydh70d4b5xgv.cloudfront.net/images/5/8/yeaoh-shinsuke-nakamura-bear-stuff-toy-new-japan-pro-wrestling-njpw-wwe-f-s-e061baf7e52e23285a4e4c738df84754.jpg"
		},
		"body_2": "",
		"img_2": {
			"alt": "",
			"src": ""
		},
		"body_3": "",
		"img_3": {
			"alt": "",
			"src": ""
		},
		"body_4": "",
		"img_4": {
			"alt": "",
			"src": ""
		}
	}]
}