{
	"article": [{
			"title_short": "205 Weekly 03/20/18",
		"title_long": "205 Weekly 03/20/18",
		"author": "Nick",
		"read_time": "10 min read",
		"pub_date": "3/21/18",
		"theme": "",
		"summary_quote": "It's best boy vs best boy",
		"caption": "205 Live Weekly",
		"caption_class": "ccard-caption",
		"tags": [
"WRESTLING",
"LOL",
"TECH",
"COMICS",
"DESIGN",
"GAMES",
"GEAR",
"MOVIES",
"SOCIAL",
"WRESTLING"
		],
		"body_1": "The second slot for the finals of the Cruiserweight Tournament is up for grabs tonight, with a match between Mustafa Ali and Drew Gulak. The rest is just there to fill up time.--- -B-Lince Dorado (with Gran Metalik and Kalisto) vs Hideo Itami (with Akira Tozawa)-E- ---A fine match. The two exchange strikes and Itami refuses the clean break, leveraging his attack into a headlock. Dorado throws out Itami and fakes a dive to the outside. Dorado then takes advantage of his speed and dropkicks Hideo back out of the ring and quickly capitalizes with a corkscrew dive. When Hideo is able to focus on his striking, this is when he is able to take control of the match. He does so with a pair of quick boots to Dorado. Hideo then smacks the hell out of Dorado and gives up his advantage by beckoning for Dorado to smack him back, which he does. Dorado then utilizes his speed to negate Hideo’s striking and cockiness. Hideo then reverts back to his bread and butter and reverses a springboard flip with a lariat. KENTA style strikes ensue, however, Dorado cuts off Hideo’s momentum with a superkick reversal. With the support of the rest of Lucha House Party on the outside, the crowd shows some sign of life with a lucha chant. Dorado elbows Hideo to the outside and Hideo, showing signs of frustration, shoves Gran Metalik on the outside. This prompts Metalik to shove him back, which leads to the referee calling for a disqualification.",
		"img_1": {
			"alt": "",
			"src": "content/wrd-20-1.jpg"
		},
		"body_2": "Had this match went five minutes longer, it would've been more effective. The crowd was warming up at the very last spot. My thought is, despite being out of the tournament, Hideo’s momentum seems to be setting him in line for a shot at whoever wins the finals at Wrestlemania. A disqualification does no favors for him, but at this point the focus of the program lies entirely on the last semi-finals matchup.---A video package for Drew Gulak plays, in which he presents a more earnest side than his typical goofy, powerpoint-giving demeanour. Drew states that he does indeed “believe in a better 205 Live”. His vision of which only makes sense with him as the champion. Previous footage of Drake Maverick is shown berating Drew for turning from a hard hitting, fear-inducing prospect in the division to a parody of himself, whose only focus is to give powerpoint presentations. Although Drew has been such a delight in this spot, so what the hell does Drake know. Gulak is one of the few people on 205 live that I feel would do very well on the main roster, if given the ability. I hope one day he breaks out and is given a shot at the main roster midcard. He’s a hell of a wrestler too, as we will see later tonight.---Cedric Alexander cuts a promo. He reflects upon the year leading up this Wrestlemania, and the fact that his spot is guaranteed on the card. Cedric states that all of his work means nothing if he doesn’t win the championship. Total nothing promo.--- -B-TJP vs Kenneth Johnson-E- ---Talk about just filling time. A short cell phone promo airs of TJP saying that he intends to fight whoever wins the match at Wrestlemania. He’s still a better promo than Cedric Alexander, whatever that’s worth. A short squash match ensues, one that’s not even worth recapping. TJP makes sure to look cocky and dab a few times for safe measure.---A video is shown for hyping the best boy and Chicago’s son, Mustafa Ali. His main goal seems to be changing the knee jerk reaction of someone hearing a foreign name like “Mustafa Ali” and thinking they have to boo. I‘m inclined to agree, Mustafa, I’m inclined to agree.---An interview with general manager Drake Maverick. Maverick is frustrated with the disqualification result earlier in the night. He announces a fatal four way matchup for the number one contendership for next week. The participants are Buddy Murphy, Kalisto, Akira Tozawa, and TJP. Maverick states that Kalisto’s and Tozawa’s inclusion is due to their noninvolvement with the disqualification earlier that night, thereby punishing Hideo Itami and Gran Metalik for their behavior. Drake has been a great general manager, with a stern but sensible approach to managing the roster. He isn’t needlessly gullable or cruel like most other on screen General Managers in the WWE.---",
		"img_2": {
			"alt": "",
			"src": "content/wrd-20-2.jpg"
		},
		"body_3": "",
		"img_3": {
			"alt": "",
			"src": ""
		},
		"body_4": "",
		"img_4": {
			"alt": "",
			"src": ""
		},
		"body_5": "",
		"img_5": {
			"alt": "",
			"src": ""
		},
		"soundcloud": "",
		"youtube": "",
		"show_portfolio": false,
		"show_blog": true
	}]
}
