{
	"article": [{
		"title_short": "Instant Classic - Okada vs. Shibata",
		"title_long": "Instant Classic - Sakura Genesis: Okada vs. Shibata",
		"author": "Nicholas Krause",
		"read_time": "4 min read",
		"pub_date": "04 April 2017",
		"theme": "",
		"summary_quote": "More stars than the Hollywood walk of fame!",
		"tags": [
			"WRESTLING",
			"GAMES",
			"MOVIES",
			"COMICS",
			"GEAR"
		],
		"body_1": "Instant Classic is a new series on LitleOverlord that dissects wrestling matches from all corners of the world that have stuck with me as important, memorable points in professional wrestling history. ",
		"img_1": {
			"alt": "",
			"src": ""
		},
		"body_2": "New Japan Pro Wrestling continues to be the greatest professional wrestling promotion in the world. Well, I should caution that this is all dependent on what the viewer seeks from their wrestling viewing: WWE tells many horrible, halfass stories in and outside the ring, but when they get it right it’s typically the best the industry has to offer. It should go without saying that if big matches are your cup of tea, then none do it better or more consistently than New Japan Pro Wrestling. Mindful, meaningful booking and a diverse range of stylistic matchups seem to be the key to NJPW’s success in regards to overall in-ring quality. From Kenny Omega to Ishi, Kushida, Hiroki Goto, Ricochet, The Young Bucks, and the list goes on, NJPW is in a really good place talent-wise (which is impressive considering the sudden departures of Shinsuke Nakamura and AJ Styles early last year). WWE, on the other hand, while also boasting incredible talent spread across RAW, Smackdown, NXT and 205 Live, struggles to find an “ace” or face of the company to replace John Cena, with the Roman Reigns experiment taking numerous turns in every direction. NJPW, on the other hand, have very solid aces, at least for their needs, in (possibly) Kenny Omega, Hiroshi Tanahashi, Tetsuya Naito, Kazuchika Okada, and now, I believe, Katsuyori Shibata.",
		"img_2": {
			"alt": "",
			"src": ""
		},
		"body_3": "Overall business for NJPW hasn’t been either particularly impressive or disappointing as of late; however, the big shows are bigger than they’ve been in a long time. Their TV deal is far from ideal but their larger shows can sell out and do good business. Their long-discussed venture into the U.S. market has begun and their first two shows sold out stateside despite zero promotion, a very good sign. Sakura Genesis, formerly called Invasion Attack, is a yearly pay-per-view held in Ryogoku Sumo Hall, a typical sellout venue for big shows like the G1 Climax. NJPW rolled into Sumo Hall on April 9th for a show with a more-than-solid undercard and utterly unforgettable main event that saw Okada defend the IWGP Heavyweight Championship against Shibata.",
		"img_3": {
			"alt": "",
			"src": ""
		}, 
		"body_4": "Hot off the heels of Okada’s Wrestle Kingdom professional wrestling clinic with Kenny Omega and his fantastic title defense against Minoru Suzuki, there’s little argument to be made that Okada isn’t the greatest wrestler in the world right now (a case can also be made for AJ Styles), in addition to having one the best years in regards to unforgettable matches than possibly any other wrestler in history, despite it only being April. Yes, he has wrestled some of the best talent in the world, a luxury many aren’t afforded, but don’t get it twisted: Okada is just that good. A seemingly rare case, of a talent handpicked by the promotion to be the top guy and it actually succeeding, at 29 years old Okada has already earned the status of Japanese wrestling icon. Okada’s next big challenge came in the form of Shibata, a wrestling veteran who has finally ascended the ranks of NJPW, most notably by winning the New Japan cup earlier in the year. A legit mixed martial artist, Shibata is known for use of strongstyle. He is currently in his second tenure at NJPW, having left all the way back in 2005. Upon returning a few years ago, his skills have evolved to being able to stand toe-to-toe with Okada. Shibata is over huge with the fans no thanks to his in-ring skills and look. On the surface there might not seem to be much with Shibata, he’s tall with a great build and a fantastic hairdo that elicits pure envy from me, but his real power comes from his in-ring skill, trademark tucked-chin and soul-piercing demeanor, and his famous headbutt, which is equal parts exciting and fear inducing. Seriously, no human should be dishing headbutts like Shibata does, it’s not healthy. Regardless, he’s going to throw them anyway and I they will always excite and frighten me. ",
		"img_4": {
			"alt": "",
			"src": ""
		},
		"body_5": "",
		"img_5": {
			"alt": "",
			"src": ""
		},
		"soundcloud": "",
		"youtube": "",
		"show_portfolio": true,
		"show_blog": true
	}]
}
