{
	"article": [{
		"title_short": "Nicks Top 10 Video Games 2016",
		"title_long": "Nicks Top 10 Video Games 2016",
		"author": "Nick",
		"read_time": "10 min read",
		"pub_date": "12/17/2016",
		"theme": "",
		"summary_quote": "It cant always be DOTA",
		"tags": [
			"GAMES",
			"GEAR",
			"WRESTLING",
			"MOVIES",
			"COMICS"	
		],
		"body_1": "-B-10. Thumper-E-  - Thumper did it. It put me in trance. All rhythm games are -I-Thumper-E- but -I-Thumper-E- is not all rhythm games. As described on its Steam store page, Thumper is a -DQ-rhythm violence-DQ- game. From the first level until the last, the percussion heavy soundtrack had me entranced, nervous and physically tense. The visuals are oppressive: think industrial machinery meets psychedelia. Admittedly, Thumper doesn’t do much; however, what it does it manage to do it does so better than any other rhythm game I’ve seen--if a similar game even exists. Thumper employes all the mechanics you might expect from a on-rails rhythm game, but it is unmatched with its violent player movement, brutal visuals, and mean, iron-fisted industrial soundtrack. I’m not sure what Thumper’s replayability will be in the future but I’m confident in saying that for the five or six hours it took to complete it, I was never more glued to my computer screen at any other point this past year.  --- -B-9. Final Fantasy XV-E- -good characterization/first good single player final fantasy game in two over a decade/fun combat/interesting premise/great and numerous endearing nuances/ despite its many downfalls i cared about the outcome of the world and its effect on the characters.",
		"img_1": {
			"alt": "Finally",
			"src": "/content/wrd-4-1.jpg"
		},
		"body_2": "-B-8. Forza Horizon 3-E- -perfect combination of -DQ-oh that car is shiny-DQ- and -DQ-how far can i hurl it through the air-DQ- / not usually a fan of realistic racing games / toes the line beautifully between the love of cars and love of arcadey racing games--- -B-7. Overwatch-E- - unparalleled world building/extremely diverse and unique cast/good focus on positive aspects of playing/may be the best in a oversaturated genre",
		"img_2": {
			"alt": "Overwatch",
			"src": "/content/wrd-4-2.png"
		},
		"body_3": "-B-6. Uncharted 4-E- - told the best story in a series that i thought i no longer cared for / typical usage of every single ounce of the playstations power/previously thought many games had -DQ-out-uncharted-DQ- uncharted but no longer feel that way.--- -B-5. Titanfall 2-E- - genuis level design / assembly line level comes to mind / mechanics are always fresh and never overstay welcome / nails movement and subsequent satisfaction / best and most fun FPS multiplayer in years if not my favorite ever / good relationship between BT and Cooper / fun and campy story / campaign leaves me wanting more but not in a way where i feel it’s unfinished or the length is necessarily a detriment ",
		"img_3": {
			"alt": "Titanfall",
			"src": "/content/wrd-4-3.jpg"
		}, 
		"body_4": "-B-4. Inside-E- - unparalleled animations and atmosphere/tense all the way until the strange and cathartic ending / good length / game i will show people that don’t play games--- -B-3. Doom-E- -best FPS campaign in many years if not ever. Music is even better if that was possible / doom slayer doesn’t give a fuck / combat is the greatest feeling combat ever / implementation of skill trees and runes at first seems bad but then ends up adding a lot to the gameplay / big surprise considering reception of multiplayer beta and lack of review codes sent out to press / best eight or so hours i’ve spent in a single video this year and in many years / excellent console versions and fantastic PC versions that would put many other AAA games to shame / After wolfenstein and DLC and DOOM ID might be my favorite developer currently",
		"img_4": {
			"alt": "Doom",
			"src": "/content/wrd-4-4.jpg"
		},
		"body_5": "-B-2. The Witness-E- - best atmosphere and visuals this year / frustrating but never unfair / a long lasting example of mastership in the craft of game development / every inch of this map is beautiful / breathtaking with fantastic gameplay to boot / evokes strange and unique emotions----B-1. Hitman-E- - perhaps one of my favorite games of all time / replayability is thru the roof / played all missions to level 20 mastery and beyond / have all trophies save for one / shame there’s no platinum trophy / ps4 has long load times but looks good and PC version is fantastic / constant flow of content from summer bonus episodes to elusive targets to holiday episode / best level design in any hitman game to date / the first true realization of a moving place in time and deep mechanics and consequences for all the players actions that disrupt and alter the state of large groups of people and their many varied functions surrounding the maps / best use of episodic content i’ve ever seen and first case of it in which i prefer that to be the way it's done / great mix of humor absurdity and serious stealth action and protagonistic and surrounding story",
		"img_5": {
			"alt": "Hit it Man",
			"src": "/content/wrd-4-5.jpg"
		},
		"soundcloud": "",
		"youtube": ""
	}]
}
