{
	"article": [{
		"title_short": "The NXT problem wrd3",
		"title_long": "NXT started as the developmental branch of WWE",
		"author": "Trevor C. Goodchild",
		"read_time": "3 min read",
		"pub_date": "7/4/1893",
		"theme": "",
		"summary_quote": "NXT started as the developmental branch of WWE",
		"tags": [
			"GAMES",
			"WRESTLING",
			"MOVIES",
			"COMICS",
			"GEAR"
		],
		"body_1": "Ideally I would've liked to start this article off by detailing what exactly NXT is. For those not in the know, NXT started as the developmental branch of WWE. World Wrestling Entertainment previously had many developmental territories under their umbrella, however, these organizations purposefully had minimal exposure and few ways for their developing talents to connect with potential fans. The formation of NXT, a proper developmental brand with both a weekly television and frequent touring, allowed new, fresh signees of the wrestling juggernaut's roster pool a chance to perform in front of moderate-sized crowds and hone their skills in the various wrestling crafts before debuting on the big stage. In hindsight, NXT seems like something that should've always been around. This, however, was not the case until late 2014. At that time, the new developmental brand was exactly like what someone trying to imagine it now would picture. It had some fresh blood right out of both the independent wrestling scene and the WWE performance center. It taped in front of relatively small crowds and it showcased some exciting wrestling with the obvious expected flaws of more green performers. This was alright, because at the time everyone knew what NXT was and more importantly, NXT knew what NXT was.",
		"img_1": {
			"alt": "Whaaaat",
			"src": "http://d2ydh70d4b5xgv.cloudfront.net/images/5/8/yeaoh-shinsuke-nakamura-bear-stuff-toy-new-japan-pro-wrestling-njpw-wwe-f-s-e061baf7e52e23285a4e4c738df84754.jpg"
		},
		"body_2": "Fast forward roughly two and half years later to summer 2016, and neither anyone in the higher-ups of WWE or the most astute, most knowledgeable wrestling fan (as most of them claim to be) can tell you what the fuck NXT quite is. Take this weekend for instance and the WWE pay-per-views airing on Saturday and Sunday nights. This weekend consists of firstly with one of WWE’s flagship yearly pay-per-views, touted as one of the “big four” events of the year, Summerslam. Secondly, is consists of a pay per view called NXT: Takeover Brooklyn II. If I were to ask you which pay-per-view sold out the 16,000 capacity Barclays center in Brooklyn, New York, featured high-profile title matches with intricate backstories and world class performances, consisted of a roster of merchandise selling world-renowned superstars, and featured multiple MOTY (match of the year) contenders, which one would you pick? The answer is both.",
		"img_2": {
			"alt": "",
			"src": ""
		},
		"body_3": "NXT is just as good as the real deal and the majority of wrestling fans that watch wrestling in any shape or form as much as I do, would be quick to tell you that NXT may even be the superior product. It’s exactly there that the NXT problem begins.",
		"img_3": {
			"alt": "",
			"src": ""
		},
		"body_4": "",
		"img_4": {
			"alt": "",
			"src": ""
		}
	}]
}