{
	"article": [{
			"title_short": "Best of the Super Juniors 25 May 19th",
		"title_long": "Best of the Super Juniors 25 May 19th",
		"author": "Nick",
		"read_time": "20 min read",
		"pub_date": "5/19/2018",
		"theme": "",
		"summary_quote": "First Round Block B Matches. Flip Gordon and Minoru Suzuki share a ring.",
		"caption": "May 19th - Block B",
		"caption_class": "ccard-caption",
		"tags": [
"WRESTLING",
"LOL",
"TECH",
"COMICS",
"DESIGN",
"GAMES",
"GEAR",
"MOVIES",
"SOCIAL",
"WRESTLING"
		],
		"body_1": "We are officially underway with Block B matches on 5/19 in Korakuen Hall. Tournament matches goes as follows: Dragon Lee vs Sho, Ryusuke Taguchi vs El Desperado, Kushida vs Chris Sabin, and Hiromu Takahashi vs Marty Scurll. This is a solid lineup and it seems Block B is the place to be. Dragon Lee and Sho is the most intriguing for me. Sho displayed tons of potential last night and, like I wrote yesterday, Dragon Lee is one hell of a dance partner.---Taguchi possess the ability to have a fantastic match, it just whether or not he decides to play goofy or serious. Chris Sabin has long been favorite of mine but he remains a bit of an unknown in regard to this tournament. Tonight is his chance to see if he’s here to hang with the likes of Kushida, who can be the best technical wrestler in the world on any given night. Scurll and Takahashi is just about as much of a guarantee for a great match as one could possibly hope for. Let’s talking about the first night of Block B matches.---",
		"img_1": {
			"alt": "Best of Super Jr",
			"src": "content/wrd-3-1.jpg"
		},
		"body_2": "-B-Prelims-E- ---Shota Umino over Yota Tsuji via a Boston Crab. As with all Young Lion’s matches, the fun is in noting their progress. I can’t help with notice how proficient and competent these guys are. Tsuji has in the New Japan system for just one year. It’s crazy to me how someone like Big Cass, who doesn’t know his ass from his ankles, is over in WWE having PPV matches with Daniel fucking Bryan. I mean, it’s not crazy to me, it’s just that the magnitude of the stage is extremely disproportionate to his skills. Where on the other hand New Japan “curtain jerkers” like Umino and Tsuji both would have better matches with Daniel Bryan, given the opportunity. Kevin Kelly notes that Tsuji played American-style Football in Japan, which is apparently a thing. Tsuji had to be disciplined for overt aggressiveness on more than one occasion.---Yoshi-Hashi, Yoh, and Will Ospreay over Tiger Mask, ACH, and Tomoyuki Oka. ACH flips Ospreay the bird while he poses in his face. This was pretty good. Yoshi-Hashi submits Oka with a -I-Butterfly Lock-E-. Everyone set their speed to 10 and just went at it for 12 or so minutes. Ospreay and ACH had the best exchanges. Yoh kind of fell into the background, not shining at any point in this match. Ospreay tells the camera that ACH can “fuck off to WWE”.---Minoru Suzuki and Kanemaru over Tona Henare and Flip Gordon. The mere idea of Flip Goron and Minoru Suzuki existing in the same universe, let alone the same wrestling ring, it hilarious to me. Flip, the flashy squeaky-clean good boy, might as well pay for his obituary while he’s at it. Suzuki, the legitimatie former MMA world champion versus the junior wrestler from Montana who happens to think the world is flat. Only in pro wrestling does happen. As Flip’s whacky “Flip! Flip! Flip!” music plays, Minoru stands in the corner smirking like a knowing shark and Kevin Kelly remarks, “I can’t imagine Minoru Suzuki thinks too highly of Flip Gordon.”---Minoru gets some serious slaps in on Flip, but he doesn’t even have the interest to play up the absurd fact that his opponent is Flip Gordon. Minoru eventually gets the pin on Henare with a -I-Gotch Piledriver-E-.---Next up is Bushi and Sanada over Taiji Ishimori and Chase Owens. This match is meant to preview Bushi vs Ishimori, which is in the coming days. It was good while it lasted and it’s worth noting how damn quick Taiji Ishimori is. At 35, he may be the fastest junior in the company. Ishimori and Bushi have some good exchanges and there’s no reason the tournament match shouldn’t be great.---",
		"img_2": {
			"alt": "",
			"src": ""
		},
		"body_3": "",
		"img_3": {
			"alt": "",
			"src": ""
		},
		"body_4": "",
		"img_4": {
			"alt": "",
			"src": ""
		},
		"body_5": "",
		"img_5": {
			"alt": "",
			"src": ""
		},
		"soundcloud": "",
		"youtube": "",
		"show_portfolio": false,
		"show_blog": true
	}]
}
