
{
	"article": [{
		"title_short": "NJPW Dominion Preview",
		"title_long": "NJPW Dominion Preview",
		"author": "Nick",
		"read_time": "10 min read",
		"pub_date": "5/31/2017",
		"theme": "",
		"summary_quote": "The six star rematch!",
		"caption": "NJPW Dominion",
		"caption_class": "ccard-caption",
		"tags": [
"WRESTLING",
"LOL",
"TECH",
"COMICS",
"DESIGN",
"GAMES",
"GEAR",
"MOVIES",
"SOCIAL",
"TECH"
		],
			"body_1": "New Japan Pro Wrestling -I-Dominion-E- airs on June 11th and is headlined by the biggest wrestling rematch of the year with Kenny Omega vs Kazuchika Okada for the heavyweight championship.--- -I-Dominion-E- has a stacked card, most of the gold is on the line, and like all big New Japan shows, I can’t see how it would disappoint. Let’s dig into it.",
		"img_1": {
			"alt": "Dominion",
			"src": "/content/wrd-13-2.jpg"
		},

		"body_2": "-B-Cody (Rhodes) vs. Michael Elgin-E- ---I wish Cody Rhodes was allowed to use his name on televised events outside of WWE because referring to him as just Cody is a little grating. He holds one of most respected last names in the entire industry.---By virtue of the rest of the card being amazing, this match doesn’t excite me a whole lot. It will be good at the very least and above all else it’s intriguing because it should give a sense of which guy is headed up a rung in the near future. Elgin has been tearing it up prior to his injury and I’m curious if his return from injury will see him in an elevated spot, perhaps even challenging for the Intercontinental championship at some point this year before the -I-Wrestle Kingdom-E- program is set in stone. Cody, on the other hand, probably shouldn’t be losing this match.---It’s been fun seeing him all over the big indies but The American Nightmare hasn’t really had an interesting program or much going on with his character outside of “Hey I’m in the Bullet Club!” If Elgin loses in an impressive effort, he’s had enough good matches recently that it won’t hurt him, however, if Cody loses I can’t help but wonder what would be next for him.--- -B-Roppongi Vice vs The Young Bucks-E- ---Baretta and Rocky Romero vs Matt and Nick Jackson for the Junior Heavyweight Tag Team Championships isn’t anything new but it should be a killer match nonetheless. It’ll be a fun, high intensity spot fest and that’s about it. Having just regained the belts, I don’t see Vice losing. The Bucks already hold the Ring of Honor tag belts which I would argue are a bit more prestigious just because there isn’t a split between Heavyweight and Junior Heavyweight in ROH.---As hands down the best tag team in the world in addition to being ROH champions, The Young Bucks have nothing to gain by winning this match and the match isn’t really about the Junior belts anyway. It’s about putin on display the pure skill of these two teams. Plus, it’ll be nice to see my boy Baretta’s hand raised, even as champ, he’s so damn underrated in just about every regard.----B-War Machine vs Gorillas of Destiny-E- ---War Machine vs Gorillas of Destiny for the Heavyweight Tag Team Championships will probably be the weaker of the two tag team bouts. War Machine are improving at a scary rate and Tama Tonga and Tanga Roa are more than competent, however, I don’t expect to see an upset or a particularly long match here. War Machine are retaining the belts.---I have no doubt this will be entertaining but it may be even less interesting than the Cody and Elgin match. This is what happens when you have two tag team championships and the majority of the exciting teams reside in the junior division.",
		"img_2": {
			"alt": "Still from NJPW Youtube Page",
			"src": "/content/wrd-13-4.jpg"
		},
		"body_3": "-B-Minoru Suzuki vs Hirooki Goto-E- ---It’s stables Suzuki-gun vs Chaos in a lumberjack match that sees Minoru Suzuki defend his newly obtained NEVER Openweight Championship against Hirooki Goto. I’m looking forward to this one. As a big Suzuki fan, it’s nice to see him with some gold, although there’s no reason for their to be this many singles competition belts in the company: The NEVER Openweight belt has pretty much no value or prestige. The championship just isn’t a clear stepping stone to anywhere up the ladder unlike the Intercontinental strap which defines top guys from the rest.---I trust New Japan to not rely too much on having the stable members outside the ring at once. There will inevitably be some brawls but I hope they use the gimmick to help advance some storylines as opposed to having the guys standing there looking like doofs like 90% of WWE lumberjack matches, which are only really used to cram everyone into one show. There’s ample opportunity for a great match to be had here and breather from the normal matches on the card. ---I don’t see Goto winning the belt back just yet.",
		"img_3": {
			"alt": "Still from NJPW Youtube Page",
			"src": "/content/wrd-13-1.jpg"
		},
		"body_4": "-B-Tetsuya Naito vs Hiroshi Tanahashi-E- --- This one is a little bitter sweet. Tanahashi completely tore his bicep a few weeks ago at ROH -I-War of the Worlds-E- and absolutely should not be wrestling this match. Things are different in Japan and Tanahashi is still set to show at Dominion and if I know anything about him, I know he’s going to try and put on a hell of a show. Say what you will about WWE, but they absolutely wouldn’t put one of their top guys, if not their top guy, in the ring with a torn bicep.---The thought is that Tanahashi wants to bring closure to his program with Naito and a torn bicep wouldn’t necessarily hinder his ability that match in the ring. I suppose in kayfabe, the injury adds to the stakes of the match, however, I’m not sure Tanahashi will even sell the injury or it will be acknowledged by commentary. We shall see.--- Outside of the torn bicep, this matchup is the second biggest of the year next to Okada and Omega. Naito’s reign as Intercontinental champ has been unbelievable and it’s so great to see a guy of such immense talent have an interesting, dominant reign. The angle with Naito slowly destroying the belt by throwing it around before matches is genius. The Intercontinental belt, along with the heavyweight belt, is quite prestigious and having Niato toss it around disrespectfully like a prop is a great way to generate heat with the crowds.---Naito furthered the angle the last few days by declaring himself to be bigger than the belt and stating that if he wins at -I-Dominion-E- he will completely destroy it. I love this and in regards to story, this is the most interesting part of the pay per view for me. I wouldn’t be surprised if Naito ends up winning, abandoning the belt and pursuing the heavyweight championship while a new Intercontinental belt is made and another champion crowned. It might devalue the belt a touch but it’s probably worth it if a new one can be made  and a new star cemented without having anyone beat Naito. ---Regardless of who wins at -I-Dominion-E-, the current belt is wrecked after Naito’s recklessness. In this case, I don’t know what a win for Tanahashi would mean for the story, especially since he has to take some time off for the torn bicep after this match. Either way, the stakes are high and the result isn’t clear, so it be a fun watch, barring the inevitable wincing knowing that Tanahashi shouldn’t be in the ring.",
		"img_4": {
			"alt": "Still from NJPW Youtube page",
			"src": "/content/wrd-13-3.jpg"
		},
		"body_5": "-B-Kazuchika Okada vs Kenny Omega-E- --- The most anticipated rematch ever. The follow up to one of the greatest wrestling matches of all time. The two best wrestlers in the world. The six star kings. Shall I go on? I will.---In my heart of hearts, I hope this is Kenny’s big moment. It seems like Naito is on his way to the top and one of these three men has to step down from the big picture for the next few months.---With the expansion to North America this summer, it makes sense for Kenny to be the champion. Outside of that, the time feels right for him. Okada’s had one hell of a reign, one of the best in all of wrestling, and he’s going to be champion many more times. Kenny, on the other hand, is a different story. It’s not certain that he’s going to stick around for the next few years, although a run with the belt might change that. Okada is a primary draw in Japan. I’m hoping that doesn’t decide who wins, because Kenny is on the cusp of being an ace for the company and a run with the belt is absolutely the thing he needs to do that.---The introduction of the brand new United States Championship has me worried. Like I said numerous times, there’s too many belts in the company and adding yet another one seems like an illadvised play. In the back of my mind, I’m thinking they made the belt for Omega to hold while they expand to North America. I’m not on board with this idea. The IWGB Heavyweight Championship is by far the most prestigious belt and Omega has put in the work to get it. We will see what happens.---This match is what wrestling is all about. A tale of the very best duo of wrestlers in the world with an outcome entirely dependent on who wants it more. Nothing more. Nothing less.---We are very lucky to see two talents like Okada and Omega in their primes battle it out like this yet again with such high stakes.",
		"img_5": {
			"alt": "",
			"src": ""
		},
		"soundcloud": "",
		"youtube": "",
		"show_portfolio": false,
		"show_blog": true
	}]
}
