{
	"article": [{
		"title_short": "How Dead Cells conquered my roguelike fatigue",
		"title_long": "How Dead Cells conquered my roguelike fatigue",
		"author": "Nick",
		"read_time": "15 min read",
		"pub_date": "05/27/2017",
		"theme": "",
		"summary_quote": "A masterclass in early access",
		"tags": [
"GAMES",
"LOL",
"TECH",
"COMICS",
"DESIGN",
"WRESTLING",
"GEAR",
"MOVIES",
"SOCIAL",
"WRESTLING"
		],
		"body_1": "Note: -I-Dead Cells-E- is currently in early access, although it may be the most complete early access product I’ve ever experienced.---Developed by Motion Twin, -I-Dead Cells’-E- inspirations are abundantly clear: A mix of -I-Castlevania-E- exploration, -I-Dark Souls progression-E-, and a roguelike structure. To stand out from the numerous games that we see enter the seemingly larger-and-larger void of new Steam releases, -I-Dead Cells-E- intelligently blends its own ideas of what a roguelike should be with the familiarities of other games. It’s how these ideas are mixed together that make for a gameplay loop that has me utterly addicted.",
		"img_1": {
			"alt": "Dead Cells",
			"src": "/content/wrd-11-1.jpg"
		},
		"body_2": "Through its many gorgeous worlds, -I-Dead Cells-E- presents a solid challenge while never feeling too difficult. The flow of combat and responsiveness of the controls is among the best I’ve ever felt in a 2D scroller. Throughout my dozen or so hours with the game, my success in every combat scenario felt like it was dependent on my ability to outperform the enemy, who has an equal, if not greater chance, of killing me if I’m slightly off beat. Although challenging, it never feels unfair. A stark contrast from other similar games that seem to equate difficulty with fun without giving the player the proper tools to succeed.---Not too cold. Not too warm. Just right.",
		"img_2": {
			"alt": "Dead Cells",
			"src": "/content/wrd-11-2.jpg"
		},
		"body_3": "The permanent upgrade structure is doled out in such a way that I never feel like my runs are meaningless if I die. As I progressed from world to world, I cashed in my “cells” to work towards upgrades like higher gold retention upon death, new weapons, and slight upgrades to damage that make trudging through the earlier levels a bit less painless. Blueprints for new weapons are dropped at such a rate there is little to no feeling of stagnation despite going through the similar procedurally generated levels a number of times before beating the new crop of enemies or the occasional boss to press forward.",
		"img_3": {
			"alt": "Dead Cells",
			"src": "/content/wrd-11-3.jpg"
		},
		"body_4": "A few years removed from the roguelike boom in games like -I-The Binding of Isaac-E-, -I-Spelunky-E-, and -I-Rogue Legacy-E-, -I-Dead Cells-E- stands tall among its peers and proves that there’s more to be found and loved in that delightfully challenging space.",
		"img_4": {
			"alt": "Dead Cells",
			"src": "/content/wrd-11-4.jpg"
		},
		"body_5": "",
		"img_5": {
			"alt": "",
			"src": ""
		},
		"soundcloud": "",
		"youtube": "",
		"show_portfolio": false,
		"show_blog": true
	}]
}
